{
    "Policy": {
        "header": "Privacy Policy",
        "dateupdate": "Last updated: February 4, 2024",
        "container": "We have tried to keep this policy as simple and legally compliant as possible to help you understand the information we collect, how we use it, and what choices you have about it. You should read this policy in full, but here is a brief summary of the key points we hope you take away from it:",
        "question_1": "1. How do we collect information?",
        "description_1_question_1": "First, we collect, store, and use the information you share on our website. This includes email addresses, comments, messages sent to other members, and any other information you choose to enter on the website.",
        "description_2_question_1": "If you post personal information of others on our website, you must ensure that you have their consent to disclose and process their personal data in accordance with this privacy policy. That is your responsibility.",
        "description_3_question_1": "Second, if you purchase something for yourself or someone else on our website, we will collect payment and tax information (e.g., country of residence), contact information, and shipping details (e.g., email address), as well as details of what you purchased.",
        "description_4_question_1": "Finally, we log certain technical information when you use our website. This includes information about your device and your interactions with our website, such as your IP address, browser type, and page views.",
        "description_5_question_1": "We also use cookies (small encrypted data files stored and sent by your web browser whenever you visit our website) to store and retrieve your login status, personality test results, and other website settings. Some cookies are account-specific, while others are not. For more information about cookies, please see the section below.",
        "question_2": "2. How do we use the information we collect?",
        "description_1_question_2": "We do not sell your personal data to anyone. Never have, never will.",
        "description_2_question_2": "Everything we know about you is what you share by visiting and interacting with our website. We do not collect your personal data from any third parties, so it is entirely up to you what you choose to share. For example, you can use our website under a pseudonym.",
        "description_3_question_2": "When you use our website, even if you are not logged in, we receive some personal information such as the type of device you are using and your IP address. You can choose to share additional information with us by creating an account. We use this information to improve our services and keep our website functional and secure.",
        "description_4_question_2": "We use your responses to surveys, tests, and other tools to determine which content is relevant to you and to improve our understanding of personality traits. You are completely free to decide which surveys to take and which tools to explore.",
        "description_5_question_2": "If you have any questions or feedback about this policy, please don’t hesitate to contact us!",
        "description_6_question_2": "We use the information we collect to provide you with our services as well as content that is relevant and personalized for you. That’s why it is necessary for us to use your information to:",
        "description_7_question_2": "Send you your personality test results if you request them on the results page or in the settings section.",
        "description_8_question_2": "Send you account-related messages, such as emails to reset your password.",
        "description_9_question_2": "Identify you and ensure the security of your account – for example, by verifying that you are the owner of the email address associated with your account.",
        "description_10_question_2": "Process payments from you and send you emails with details of your purchase if you decide to buy something from us.",
        "description_11_question_2": "Provide you with content and services that are relevant to you – for example, information for people with your personality type.",
        "description_12_question_2": "Help you connect with other members – for example, by automatically generating a friend request if someone tries to invite you via email.",
        "description_13_question_2": "Respond to your questions or complaints about the use of our website.",
        "description_14_question_2": "We have a legitimate interest in using your information in these ways. It is necessary for us to do so to make our services and content as relevant as possible for you, which benefits both of us.",
        "description_15_question_2": "Additionally, we have a legitimate interest in maintaining our relationship with you, improving our website and services, and protecting both you and other users.",
        "description_16_question_2": "As a result, we use your information to:",
        "description_17_question_2": "Analyze how you use our website to better understand your needs and improve our services and experience. For example, by measuring how long you spend on a specific page before and after a design change, we can determine what we need to improve. To do this, we use third-party services such as Google Analytics to collect standard internet log information and details of visitor behavior patterns (e.g., how long you spend reading your personality test results). If we have an existing customer relationship with you, we may also use Facebook Pixel to analyze the effectiveness of our Facebook advertising. We have already described these services in the cookie section above.",
        "description_18_question_2": "Improve our website and develop new features. For example, if most people responding to our surveys say they want to learn more about dealing with difficult coworkers, we will likely consider that.",
        "description_19_question_2": "Conduct internal analysis and scientific/statistical research to improve our services and understanding of personality traits. For example, your survey responses may help us determine whether Extraverts or Introverts are more likely to initiate first. The raw research data you provide is anonymized or pseudonymized, and access to it is strictly controlled. Even our own researchers only see data that cannot be linked back to any specific individual, and we only publish aggregated statistical data.",
        "description_20_question_2": "Keep our website secure and prevent fraud – for example, by logging verification attempts or account-related activities.",
        "description_21_question_2": "Ensure the safety of you and other users, including cooperating with law enforcement when necessary. For example, we may notify the police if something you post leads us to believe you or someone else is in immediate physical danger.",
        "description_22_question_2": "Ensure compliance with the terms governing website usage – for example, by reviewing private messages if another user complains about harassment.",
        "description_23_question_2": "While our legitimate interests cover much of what we do, in the following cases, other legal bases apply to how we process your personal data:",
        "description_24_question_2": "Where we require explicit consent from you for specific processing.",
        "description_25_question_2": "Where we provide you with a service as a member – in this case, we have a contract with you for this purpose, and we process your data in accordance with our contract with you (see our terms of service). Specifically, our contract allows us to retain and delete data in ways that override certain rights you may have if we were relying on consent or our legitimate interests as the legal basis for processing the data in question.",
        "description_26_question_2": "Where we provide you with a service as a member – in this case, we have a contract with you for this purpose, and we process your data in accordance with our contract with you (see our terms of service). Specifically, our contract allows us to retain and delete data in ways that override certain rights you may have if we were relying on consent or our legitimate interests as the legal basis for processing the data in question.",
        "description_27_question_2": "Where another legal basis applies (which is rare) – for example, to protect your vital interests or those of another person, or where we are required to process information by law."
      }
}