{
  "Navbar": {
    "navLinks": {
      "home": "ទំព័រដើម",
      "test": "តេស្ត",
      "university": "គ្រឹះស្ថានសិក្សា",
      "jobs": "ការងារ",
      "privacyPolicy": "ឯកជនភាព",
      "aboutUs": "អំពីយើង"
    },
    "buttons": {
      "signIn": "ចូលគណនី",
      "khmerLanguage": "ភាសាខ្មែរ",
      "englishLanguage": "អង់គ្លេស"
    }
  },
  "HomePage": {
    "heading": {
      "part1": "ស្វែងរក",
      "part2": "ជំនាញឯកទេស",
      "part3": "របស់អ្នក"
    },
    "description": "ការជ្រើសរើសអាជីពអាចជាបញ្ហាប្រឈមសម្រាប់មនុស្សជាច្រើន ប៉ុន្តែការយល់ដឹងអំពីខ្លួនឯង ចំណូលចិត្ត សមត្ថភាព និងបុគ្គលិកលក្ខណៈ គឺជាជំហានដំបូងដែលជួយឱ្យអ្នករកឃើញអាជីពដែលសាកសមបំផុត។",
    "getstart": "តោះចាប់ផ្តើម",
    "contain": {
      "part1": "តើ",
      "part2": " E-Found",
      "part3": " សម្រាប់អ្នកណា?",
      "description": "គេហទំព័រនេះមានគោលបំណងទម្រង់ទិស សិស្សវិទ្យាល័យ, សិស្សនិស្សិត និង បុគ្គលិក ដើម្បីស្វែងយល់ពីខ្លួនឯង និងជ្រើសរើសអាជីពបានត្រឹមត្រូវ។",
      "stu-high-school": "សិស្សវិទ្យាល័យ",
      "stu-university": "សិស្សនិស្សិត",
      "Staff-working": "បុគ្គលិកកំពុងធ្វើការ"
    },
    "featureCard1": {
      "title": "សិស្សវិទ្យាល័យ",
      "description": "សិស្សវិទ្យាល័យអាចស្វែងយល់ពីចំណង់ចំណូលចិត្តរបស់ខ្លួននិងមុខវិជ្ជាដែលខ្លួនចូលចិត្ត"
    },
    "featureCard2": {
      "title": "សិស្សសាកលវិទ្យាល័យ",
      "description": "សិស្សសាកលវិទ្យាល័យដែលមានអារម្មណ៍ថាកំពុងជ្រើសរើសជំនាញខុស"
    },
    "featureCard3": {
      "title": "បុគ្គលិកកំពុងធ្វើការ",
      "description": "បុគ្គលិកដែលមានបំណងចង់ផ្លាស់ប្តូរការងារ ដែលមិនច្បាស់នឹងជំនាញដែលខ្លួនកំពុងធ្វើ"
    },
    "ConatianFeature": {
      "Feature": "មុខងារសំខាន់ៗ",
      "features": [
        {
          "title": "ប្រឹក្សាពីអាជីពការងារ​ និងមុខជំនាញ នៅសាកលវិទ្យាល័យ",
          "description": "អ្នកនឹងទួលបានការណែនាំអំពីការងារ និងសាកលដែលសាកសមនឹងបុគ្គលិកលក្ខណៈរបស់អ្នក។"
        },
        {
          "title": "ស្វែងរកទេពកោសល្យ",
          "description": "ស្វែងយល់ពីចំណុចខ្លាំង និងសមត្ថភាពពិសេសរបស់អ្នកតាមរយៈការធ្វើតេស្តដ៏ទូលំទូលាយ។"
        },
        {
          "title": "ការស្វែងយល់ពីអាជីព",
          "description": "ស្វែងយល់ពីរបៀបដែលជំនាញឯកទេសផ្សេងៗអាចបម្លែងទៅជាឱកាសការងារក្នុងទីផ្សារជាក់ស្តែង។"
        },
        {
          "title": "សន្ទនាជាមួយ AI",
          "description": "ប្រើប្រាស់មុខងារ AI Chatbot ដើម្បីសួរនាំបន្ថែម ទៅលើលទ្ធផលតេស្តរបស់លោកអ្នកដែលទទួលបាន។"
        },
        {
          "title": "ការធ្វើតេស្តសមត្ថភាព",
          "description": "ស្វែងយល់អំពីសមត្ថភាពភាពខ្លាំងខ្សោយនៃជំនាញតាម 1st O*NET Database សម្រាប់ទីផ្សារការងារបច្ចុប្បន្ន។"
        }
      ]
    },
    "trendingJob": {
      "title": "ការងារដែលមានតម្រូវការខ្ពស់",
      "moreInfo": "ព័ត៌មានបន្ថែម"
    },
    "PopularUniversities": {
      "title": "ស្ថាប័នអប់រំ និង បណ្តុះបណ្តាលដែលមានប្រជាប្រិយភាព",
      "moreInfo": "ព័ត៌មានបន្ថែម"
    },
    "ExpertConsultation": {
      "title": "ពិគ្រោះយោបល់ជាមួយក្រុមអ្នកជំនាញរបស់",
      "highlight": " E-Found"
    },
    "Consult_with_our_team": {
      "Chen_Phirum": "ចិន ភារម្យ",
      "Reksmey-Mom": "មុំ រស្មី",
      "Chhaya-Chan": "ចាន់ ឆៃយ៉ា",
      "Keo-KAY": "កាយ កែវ",
      "role-director": "នាយកវិទ្យាស្ថាន ISTAD",
      "role-Office": "ប្រធានការិយាល័យសិក្សា",
      "role-instructor": "គ្រូបង្គោល",
      "btn": "សន្ទនាឥឡូវនេះ",
      "Will be available soon": "នឹងមកដល់ក្នុងពេលឆាប់ៗនេះ!",
      "description": "យើង​កំពុង​ធ្វើ​ការ​យ៉ាង​ខ្លាំង​ដើម្បី​នាំ​មក​ជូន​អ្នក​នូវ​អ្វី​ដែល​អស្ចារ្យ។"
    },
    "Process": {
      "title": "ដំណើរការរបស់",
      "highlight": " E-Found",
      "description": "ការជ្រើសរើសអាជីពការងារត្រឹមត្រូវអាចជាបញ្ហាប្រឈមប៉ុន្តែការយល់ដឹងពីខ្លួនអ្នកគឺជាជំហានដំបូងឆ្ពោះទៅរកការស្វែងរកអាជីពដែលសាកសមនឹងអ្នក។ ដើម្បីអាចឱ្យ E-Found ជួយតម្រង់ទិសអ្នកបានត្រឹមត្រូវ សូមលោកអ្នកអនុវត្តន៍ជំហានទាំងបីដូចខាងក្រោម៖",
      "steps": [
        {
          "number": "ជំហានទី១",
          "description-part1": "អ្នកអាចធ្វើការចុះឈ្មោះដើម្បីចូលទៅប្រើប្រាស់ website របស់យើងដោយប្រើ",
          "description-part2": "អ៉ីម៉ែល",
          "description-part3": "និង",
          "description-part4": "ពាក្យសម្ងាត់",
          "description-part5": "ឬ អាចភា្ជប់ជានឹង គណនី",
          "description-part6": "Google",
          "description-part7": "របស់លោកអ្នក។"
        },
        {
          "number": "ជំហានទី២",
          "description-part1": "ដើម្បីជ្រើសរើសប្រភេទតេស្ត អ្នកត្រូវធ្វើការចុច",
          "description-part2": "តេស្ត",
          "description-part3": "នៅលើ Navbar"
        },
        {
          "number": "ជំហានទី៣",
          "description": "អ្នកនឹងទទួលបានលទ្ធផលសង្ខេបទៅតាមប្រភេទតេស្ត​​ ព្រមទាំងការណែនាំពីមុខជំនាញសិក្សានិងការងារដែលសាកសម។"
        }
      ]
    },
    "Testimonial": {
      "title": "មតិយោបល់",
      "decision-part1": "នេះជាមតិដែលអ្នកប្រើមួយចំនួនរបស់យើងនិយាយអំពី",
      "decision-part2": "E-Found",
      "decision-part3": "ក្រោយពីការធ្វើតេស្ត"
    }
  },
  "Abbout": {
    "title-1": "ការណែនាំអំពី",
    "title-2": "E-Found",
    "description": "ជួយសិស្សថ្នាក់មធ្យមសិក្សាទុតិយភូមិ ក្នុងការជ្រើសរើសមុខវិជ្ជាសិក្សានៅសាកលវិទ្យាល័យដោយផ្តល់ឱ្យពួកគេនូវ ឱកាសសិក្សាស្វែងយល់អំពីសមត្ថភាព ការចាប់អារម្មណ៍ និងគោលដៅអនាគត។ យើងបំពេញបេសកកម្មនេះតាមរយៈការធ្វើតេស្តលើ បុគ្គលិកលក្ខណៈ តាមចំណាប់អារម្មណ៍ តាមគុណតម្លៃ ភាពខ្លាំងខ្សោយ តាមរបៀបសិក្សា និងការចែករំលែកចំណេះដឹងពីវិស័យនានា។",
    "btn-start": "តោះចាប់ផ្តើម",
    "mission": "គោលបំណង",
    "mission-description": "ក្រុមរបស់យើងប្តេជ្ញាចិត្តក្នុងការផ្តល់ជូននូវ ការណែនាំ និងការគាំទ្រដែលអ្នកត្រូវការដើម្បីធ្វើការសម្រេចចិត្តដោយមានព័ត៌មានគ្រប់គ្រាន់អំពីអនាគតរបស់អ្នក។ ជាមួយនឹងគេហទំព័រយើង អ្នកនឹងមានទំនុកចិត្តក្នុងការជ្រើសរើសផ្លូវការសិក្សាដែលត្រូវនឹងគោលដៅ និងក្តីស្រមៃរបស់អ្នក។",
    "vision": "ចក្ខុវិស័យ",
    "vision-description": "ក្លាយជាវេទិកាមួយដ៏គួរឱ្យទុកចិត្តសម្រាប់សិស្សថ្នាក់មធ្យមសិក្សាទុតិយភូមិ ដែលស្វែងរកការណែនាំក្នុងការជ្រើសរើសមុខវិជ្ជាសិក្សា និងការគ្រប់គ្រងគោលដៅអាជីពដើម្បីទទួលបានជោគជ័យក្នុងអនាគត។",
    "our mentors": "ណែនាំដោយ",
    "cher-mey": "អ្នកគ្រូ មុំ រស្មី",
    "cher-leang": "លោកគ្រូ​ អ៉ឹង មួយលាង",
    "team": "សមាជិកក្រុម",
    "SkeletonOne": {
      "header": "និស្សិត ISTAD",
      "description": "ក្រុមនិស្សិតអាហារូបករណ៍ព័ត៌មានវិទ្យា វគ្គកម្រិតមូលដ្ឋានជំនាន់ទី២  នៃមជ្ឈមណ្ឌល សាយអិនស៍ អេន ថេកណឡជី អ៊ែតវ៉ានស៍ ឌីវេឡុបម៉ិន (ISTAD) "
    },
    "SkeletonTwo": {
      "header": "សកម្មភាពប្រឡង",
      "description": "សកម្មភាពប្រឡងប្រចាំខែរបស់និស្សិតអាហារូបករណ៍ព័ត៌មានវិទ្យា វគ្គកម្រិតមូលដ្ឋានជំនាន់ទី២ "
    },
    "SkeletonThree": {
      "header": "សកម្មភាពចូលរួម",
      "description": "កម្មវិធី  «វេទិការដ្ឋាភិបាលឌីជីថលឆ្នាំ២០២៤ និងពិព័រណ៍រដ្ឋាភិបាលឌីជីថល និងបច្ចេកវិទ្យាឌីជីថលកម្ពុជា-អន្តរជាតិ»"
    },
    "SkeletonFour": {
      "header": "ដំណើរទស្សនកិច្ចសិក្សា",
      "description": "ទស្សនកិច្ចនៅការិយាល័យរបស់ក្រុមហ៊ុន RMA Cambodia ផ្ទាល់ ហើយបានសួរនិង ឆ្លើយសំណួរ ជាច្រើន ទាក់ទងនឹងក្រុមហ៊ុន ក៏ដូចជាការត្រៀមខ្លួនដើម្បីទទួលបាន ឱកាស ចូលបម្រើការងារ ផងដែរ ។"
    },
    "header_01": {
      "title": "បច្ចេកវិទ្យាដែលប្រើនៅក្នុង E-Found",
      "Technology_01": "ភាសា Programming ",
      "des_01": "សម្រាប់ E-Found យើងប្រើ Next.js សម្រាប់ផ្នែកអភិវឌ្ឍខាងមុខ, FastAPI សម្រាប់ផ្នែកអភិវឌ្ឍខាងក្រោយ និង PostgreSQL សម្រាប់មូលដ្ឋានទិន្នន័យ។",
      "Technology_02": "បច្ចេកវិទ្យា Scraping ",
      "des_02": "យើងក៏ប្រើឧបករណ៍ដូចជា BeautifulSoup, Selenium, និង Puppeteer ដើម្បីសម្រួលកិច្ចការគេហទំព័រ។ ជាមួយ Django បម្រើជាក្របខណ្ឌសម្រាប់គ្រប់គ្រង និងរៀបចំដំណើរការ scraping ។",
      "Technology_03": "បច្ចេកវិទ្យា Recommendation ",
      "des_03": "E-Found ប្រមូល និងរៀបចំទិន្នន័យសម្រាប់ការរៀនម៉ាស៊ីនគំរូដោយប្រើ scikit-learn ដែលរួមបញ្ចូលទាំងការបណ្តុះបណ្តាលគំរូដោយប្រើ ក្បួនដោះស្រាយដូចជា Logistic Regression និង Random Forest, រួមជាមួយនឹងការវាយតម្លៃបន្ត និងការកែលម្អ។ លើសពីនេះយើងក៏រួមបញ្ចូល AI ផងដែរ ដើម្បីបង្កើនភាពត្រឹមត្រូវរបស់យើងបន្ថែមទៀត។"
    }
  },

  "University": {
    "highlight": "ឈានទៅរកអនាគតរបស់អ្នកនៅថ្ងៃនេះ",
    "header": "គ្រឹះស្ថានអប់រំ និង បណ្តុះបណ្តាលនៅកម្ពុជា",
    "description": "អ្នកអាចស្វែងរកឈ្មោះគ្រឹះស្ថានអប់រំ និងបណ្តុះបណ្តាលផ្សេងៗ ព្រមទាំងព័ត៌មានអំពីជំនាញ ទីតាំង តម្លៃសិក្សា និងជំនាញពេញនិយមនៅគ្រឹះស្ថាននីមួយៗ។",
    "see-btn": "តោះចាប់ផ្តើម",
    "search": "ស្វែងរកនៅទីនេះ...",
    "filter-1": "គ្រឹះស្ថានអប់រំ និង បណ្តុះបណ្តាលទាំងអស់",
    "filter-2": "រាជធានីភ្នំពេញ",
    "seach-header": "កំណត់ការស្វែងរក",
    "PUBLIC": "សាកលវិទ្យាល័យរដ្ឋ",
    "PRIVATE": "សាកលវិទ្យាល័យឯកជន",
    "TVET": "កម្មវិធីបណ្តុះបណ្តាលជំនាញបច្ចេកទេស និងវិជ្ជាជីវៈ",
    "MAJORS_COURSES": "កម្មវិធីសិក្សាជំនាញខ្លីៗ",
    "Phnom Penh": "រាជធានីភ្នំពេញ",
    "Battambang": "បាត់ដំបង",
    "Siem Reap": "សៀមរាប",
    "Banteay Meanchey": "បន្ទាយមានជ័យ",
    "Kampong Cham": "កំពង់ចាម",
    "Kampong Speu": "កំពង់ស្ពឺ",
    "Kampong Thom": "កំពង់ធំ",
    "Kampot": "កំពត",
    "Kandal": "កណ្តាល",
    "Koh Kong": "កោះកុង",
    "Kratié": "ក្រចេះ",
    "Mondulkiri": "មណ្ឌលគិរី",
    "Preah Vihear": "ព្រះវិហារ",
    "Prey Veng": "ព្រៃវែង",
    "Pursat": "ពោធិ៍សាត់",
    "Ratanakiri": "រតនៈគិរី",
    "Preah Sihanouk": "ព្រះសីហនុ",
    "Stung Treng": "ស្ទឹងត្រែង",
    "Svay Rieng": "ស្វាយរៀង",
    "Takéo": "តាកែវ",
    "Oddar Meanchey": "ឧត្តមានជ័យ",
    "Kep": "កែប",
    "Pailin": "ប៉ៃលិន",
    "Tboung Khmum": "ត្បូងឃ្មុំ",
    "contain-1": "គ្រឹះស្ថានអប់រំ និង បណ្តុះបណ្តាល",
    "not-found": "ការស្វែងរករបស់អ្នកមិនមាននិទ្នន័យ",
    "Pagination-page": "ទំព័រទី",
    "of": "នៃ",
    "School location": "ទីតាំងសាលា",
    "mission": "បេសកកម្ម",
    "vission": "ចក្ខុវិស័យ",
    "see more": "មើលបន្ថែម",
    "Show Less": "បង្ហាញតិច",
    "abbout-scholl": "អំពីសាលា",
    "Academic skills": "ជំនាញសិក្សា",
    "price": "តម្លៃសិក្សា៖",
    "select-faculty": "ជ្រើសរើសមហាវិទ្យាល័យ",
    "Duration": "សិក្សារយៈពេល ",
    "hours": "ម៉ោង",
    "years": "ឆ្នាំ",
    "COURSE": "/មួយវគ្គសិក្សា",
    "Inyears": "/មួយឆ្នាំ",
    "BACHELOR": "ថ្នាក់បរិញ្ញាបត្រ",
    "ASSOCIATE": "ថ្នាក់បរិញ្ញាបត្ររង",
    "SHORT_COURSE": "វគ្គសិក្សាខ្លីៗ",
    "MASTER": "ថ្នាក់អនុបណ្ឌិត",
    "PHD": "ថ្នាក់បណ្ឌិត",
    "Previous": "ថយក្រោយ",
    "Next": "បន្ទាប់",
    "type": "ប្រភេទ",
    "Popularskills": "ជំនាញពេញនិយម ",
    "SelectDegree": "ជ្រើសរើសកម្រិតសិក្សា",
    "notfound": "រកមិនឃើញមុខជំនាញ និងមហាវិទ្យាល័យដែលបានជ្រើសរើសទេ "
  },

  "Jobs": {
    "title": "ជាមួយការងារដែលមានតម្រូវការខ្ពស់ក្នុងទីផ្សារ",
    "desc": "តាមដានទីផ្សារការងារដោយប្រើឧបករណ៍ឆ្លាតវៃរបស់យើងជាមួយនឹងការវិភាគទិន្នន័យដើម្បីស្វែងរកការងារដែលកំពុងពេញនិយម។ យើងនាំមកជូនអ្នកនូវឱកាសការងារដែលមានតម្រូវការខ្ពស់បំផុត ដើម្បីជួយអ្នករៀបចំផែនការសម្រាប់អនាគតដ៏ជោគជ័យ។",
    "highlight": "ឈានទៅរកអនាគតរបស់អ្នកនៅថ្ងៃនេះ",
    "search": "ស្វែងរកការងារនៅទីនេះ...",
    "fliter": "កំណត់ទិន្នន័យ",
    "type": "ប្រភេទការងារ",
    "Location": "ទីកន្លែងបំពេញការងារ",
    "JobType": "ប្រភេទនៃការបំពេញការងារ",
    "QuizButton": "កំណត់ឡើងវិញ",
    "job": "ឱកាសការងារ",
    "not-found-1": "មិនមានការងារដែលអ្នកកំពុងស្វែងរក",
    "not-found-2": "សូមព្យាយាមមើលម្តងទៀតនៅពេលក្រោយ",
    "JobBannerCard-title": "មិនទាន់ដឹងថាការងារមួយណាសាកសមនឹងអ្នក?",
    "JobBannerCard-desc": "សាកល្បងតេស្តវាយតម្លៃរបស់យើង និងស្វែងរកអាជីព ការងារដ៏មានសក្តានុពលនៅថ្ងៃនេះ",
    "JobBannerCard-buttonText": "សាកល្បងតេស្ត",
    "Apply Now": "ដាក់ពាក្យ",
    "categorylabel": "ប្រភេទការងារ",
    "timeLabel": "ប្រភេទនៃការបំពេញការងារ",
    "locationLabel": "អាស័យដ្ឋាន",
    "jobDescLabel": "ការណែនាំពីការងារ",
    "jobRequirementLabel": "តម្រូវការការងារ",
    "jobResponseLabel": "តួនាទីការងារ",
    "aboutCompanyLabel": "អំពីក្រុមហ៊ុន",
    "websiteLabel": "គេហទំព័រ",
    "socialLabel": "បណ្តាញសង្គម"
  },
  "Footer": {
    "description": "E-Found គឺជាគេហទំព័រដែលជួយឲ្យអ្នកស្គាល់ខ្លួនឯងកាន់តែច្បាស់និងមានប្រសិទ្ធភាពក្នុងការចាប់យកអាជីពនៅពេលបច្ចុប្បន្ននិងអនាគត។",
    "navigationTitle": {
      "navLinks": "មាតិកា",
      "navLinks1": "ទំព័រដើម",
      "navLinks2": "តេស្ត",
      "navLinks3": "គ្រឹះស្ថានសិក្សា",
      "navLinks4": "ការងារ",
      "navLinks5": "ឯកជនភាព",
      "navLinks6": "អំពីយើង"
    },
    "contactTitle": "ព័ត៌មានទំនាក់ទំនង",
    "contact": {
      "phone": "លេខទូរស័ព្ទ",
      "email": "អ៉ីមែល",
      "address": {
        "text": "សង្កាត់បឹងកក់១ ខណ្ឌទួលគោក រាជធានីភ្នំពេញ",
        "label": "អាសយដ្ឋាន"
      }
    },
    "sponsoredBy": "ឧបត្ថម្ភដោយ",
    "organizedBy": "រៀបចំដោយ",
    "copyright": "Copyright E-Found by",
    "allRightsReserved": "រក្សាសិទ្ធិគ្រប់យ៉ាង។™"
  },

  "Policy": {
    "header": "គោលការណ៍ឯកជនភាព",
    "dateupdate": "កែប្រែចុងក្រោយ៖ ថ្ងៃទី 4 ខែ កុម្ភៈ ឆ្នាំ 2024",
    "container": "យើងបានព្យាយាមរក្សាគោលការណ៍នេះឱ្យមានលក្ខណៈសាមញ្ញ និងមិនស្របច្បាប់តាមដែលអាចធ្វើទៅបានដើម្បីជួយអ្នកឱ្យយល់ពីព័ត៌មានដែលយើង ប្រមូល របៀបដែលយើងប្រើប្រាស់វា និងជម្រើសអ្វីដែលអ្នកមានអំពីវា។ អ្នកគួរតែអានគោលការណ៍នេះឱ្យបានពេញលេញ ប៉ុន្តែនេះគឺជាការសង្ខេបយ៉ាងខ្លីជាមួយនឹងចំណុចសំខាន់ៗដែលយើងសង្ឃឹមថាអ្នកនឹងដកចេញពីវា៖",
    "question_1": "1. តើយើងប្រមូលព័ត៌មានដោយរបៀបណា?",
    "description_1_question_1": "ដំបូង យើងប្រមូល រក្សាទុកនិងប្រើប្រាស់ព័ត៌មានដែលអ្នកចែករំលែកនៅលើគេហទំព័ររបស់យើង។វារួមបញ្ចូលអាសយដ្ឋានអ៊ីមែល មតិយោបល់ សារដែលបានផ្ញើទៅសមាជិកផ្សេងទៀត និងព័ត៌មានផ្សេងទៀតដែលអ្នកជ្រើសរើសបញ្ចូលនៅលើគេហទំព័រ។",
    "description_2_question_1": "ប្រសិនបើអ្នកបង្ហោះព័ត៌មានផ្ទាល់ខ្លួនរបស់បុគ្គលផ្សេងទៀតនៅលើគេហទំព័ររបស់យើង អ្នកត្រូវតែប្រាកដថាអ្នកមានការយល់ព្រមពីបុគ្គលនោះចំពោះការបង្ហាញ និងដំណើរការទិន្នន័យផ្ទាល់ខ្លួនរបស់ពួកគេដោយអនុលោមតាមគោលការណ៍ឯកជនភាពនេះ។ នោះជាទំនួលខុសត្រូវរបស់អ្នក។",
    "description_3_question_1": "ទីពីរ ប្រសិនបើអ្នកទិញអ្វីមួយសម្រាប់ខ្លួនអ្នក ឬសម្រាប់នរណាម្នាក់ផ្សេងទៀតនៅលើគេហទំព័ររបស់យើង យើងនឹងប្រមូលព័ត៌មានអំពីការទូទាត់ និងពន្ធ (ឧ. ប្រទេសនៃលំនៅដ្ឋាន) ព័ត៌មានទំនាក់ទំនង និងការដឹកជញ្ជូន (ឧ. អាសយដ្ឋានអ៊ីមែល) និងព័ត៌មានលម្អិតនៃអ្វីដែលអ្នកបានទិញ។",
    "description_4_question_1": "ជាចុងក្រោយ យើងកត់ត្រាព័ត៌មានបច្ចេកទេសជាក់លាក់ នៅពេលណាដែលអ្នកប្រើគេហទំព័ររបស់យើង។ នេះរួមបញ្ចូលព័ត៌មានអំពីឧបករណ៍របស់អ្នក និងអំពីការចូលមើល និងប្រើប្រាស់គេហទំព័ររបស់យើង ដូចជាអាសយដ្ឋាន IP របស់អ្នក ប្រភេទកម្មវិធីរុករកតាមអ៊ីនធឺណិត ការមើលទំព័រជាដើម។",
    "description_5_question_1": "យើងក៏ប្រើ cookie (ឯកសារទិន្នន័យដែលបានអ៊ិនគ្រីបតូចៗរក្សាទុក និងផ្ញើដោយកម្មវិធីរុករកតាមអ៊ីនធឺណិតរបស់អ្នក រាល់ពេលដែលអ្នកចូលមើលគេហទំព័ររបស់យើង) ដើម្បីរក្សាទុក និងទាញយកស្ថានភាពចូលរបស់អ្នក លទ្ធផលតេស្តបុគ្គលិកលក្ខណៈ និងការកំណត់គេហទំព័រផ្សេងៗ។ cookie មួយចំនួនមានគណនីជាក់លាក់ ខណៈដែលខ្លះទៀតមិនមាន។ សម្រាប់ព័ត៌មានបន្ថែមអំពី cookie សូមមើលផ្នែកខាងក្រោម។",
    "question_2": "2. តើយើងប្រើប្រាស់ព័ត៌មានដែលយើងប្រមូលដោយរបៀបណា?",
    "description_1_question_2": "យើងមិនលក់ទិន្នន័យផ្ទាល់ខ្លួនរបស់អ្នកទៅនរណាម្នាក់ទេ។ មិនដែលមាន នឹងមិនដែលមាន។",
    "description_2_question_2": "អ្វីទាំងអស់ដែលយើងដឹងអំពីអ្នកគឺជាអ្វីដែលអ្នកចែករំលែកដោយការចូលមើល និងរុករកគេហទំព័ររបស់យើង។ យើងមិនប្រមូលព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នកពីភាគីទីបីណាមួយឡើយ ដូច្នេះវាអាស្រ័យលើអ្នកទាំងស្រុងក្នុងការសម្រេចចិត្តអ្វីដែលអ្នកចង់ចែករំលែក។ ឧទាហរណ៍អ្នកអាចប្រើគេហទំព័ររបស់យើងក្រោមឈ្មោះក្លែងក្លាយ។",
    "description_3_question_2": "នៅពេលអ្នកប្រើគេហទំព័ររបស់យើង ទោះបីជាអ្នកមិនបានចូលក៏ដោយ យើងទទួលបានព័ត៌មានផ្ទាល់ខ្លួនមួយចំនួនពីអ្នក ដូចជាប្រភេទឧបករណ៍ដែលអ្នកកំពុងប្រើ និងអាសយដ្ឋាន IP របស់អ្នក។ អ្នកអាចជ្រើសរើសចែករំលែកព័ត៌មានបន្ថែមជាមួយយើងដោយបង្កើតគណនីមួយ។ យើងប្រើប្រាស់ព័ត៌មាននេះសម្រាប់ការកែលម្អសេវាកម្មរបស់យើង និងសម្រាប់ការរក្សាគេហទំព័ររបស់យើងឱ្យមានមុខងារ និងសុវត្ថិភាព។",
    "description_4_question_2": "យើងប្រើចម្លើយរបស់អ្នកចំពោះការស្ទង់មតិ ការធ្វើតេស្ត និងឧបករណ៍ផ្សេងទៀតរបស់យើងដើម្បីកំណត់ថាតើខ្លឹមសារណាដែលពាក់ព័ន្ធនឹងអ្នក និងដើម្បីកែលម្អការយល់ដឹងរបស់យើងអំពីលក្ខណៈបុគ្គលិកលក្ខណៈ។ អ្នក​មាន​សេរីភាព​ទាំងស្រុង​ក្នុង​ការ​សម្រេច​ចិត្ត​ថា​តើ​ការ​ស្ទង់​មតិ​មួយ​ណា​ត្រូវ​ធ្វើ និង​ឧបករណ៍​ណា​ដែល​ត្រូវ​រុករក។",
    "description_5_question_2": "ប្រសិនបើអ្នកមានសំណួរ ឬយោបល់ណាមួយទាក់ទងនឹងគោលការណ៍នេះ សូមកុំស្ទាក់ស្ទើរក្នុងការទំនាក់ទំនង!",
    "description_6_question_2": "យើងប្រើប្រាស់ព័ត៌មានដែលយើងប្រមូលដើម្បីផ្តល់ឱ្យអ្នកនូវសេវាកម្មរបស់យើង ក៏ដូចជាខ្លឹមសារដែលពាក់ព័ន្ធ និងផ្ទាល់ខ្លួនសម្រាប់អ្នក។ ដូច្នេះហើយ វាចាំបាច់សម្រាប់ពួកយើងក្នុងការប្រើប្រាស់ព័ត៌មានរបស់អ្នកដើម្បី៖",
    "description_7_question_2": "ផ្ញើឱ្យអ្នកនូវលទ្ធផលតេស្តបុគ្គលិកលក្ខណៈរបស់អ្នក ប្រសិនបើអ្នកស្នើសុំពួកវានៅក្នុងអេក្រង់លទ្ធផល ឬនៅក្នុងផ្នែកការកំណត់។",
    "description_8_question_2": "ផ្ញើសារដែលទាក់ទងនឹងគណនីរបស់អ្នក ដូចជាអ៊ីមែលដើម្បីប្តូរពាក្យសម្ងាត់។",
    "description_9_question_2": "កំណត់អត្តសញ្ញាណអ្នក និងធានាសុវត្ថិភាពនៃគណនីរបស់អ្នក - ឧ. ដោយផ្ទៀងផ្ទាត់ថាអ្នកជាម្ចាស់អាសយដ្ឋានអ៊ីមែលដែលបានភ្ជាប់ទៅគណនីរបស់អ្នក។",
    "description_10_question_2": "ប្រមូលការទូទាត់ពីអ្នក ហើយផ្ញើអ៊ីមែលមកអ្នកជាមួយនឹងព័ត៌មានលម្អិតនៃការបញ្ជាទិញរបស់អ្នក ប្រសិនបើអ្នកសម្រេចចិត្តទិញអ្វីមួយពីយើង។",
    "description_11_question_2": "ផ្តល់ឱ្យអ្នកនូវខ្លឹមសារ និងសេវាកម្មដែលទាក់ទងនឹងអ្នក - ឧ. ព័ត៌មានសម្រាប់មនុស្សដែលមានប្រភេទបុគ្គលិកលក្ខណៈរបស់អ្នក។",
    "description_12_question_2": "ជួយអ្នកឱ្យភ្ជាប់ទំនាក់ទំនងជាមួយសមាជិកផ្សេងទៀត - ឧ. ដោយបង្កើតសំណើសុំមិត្តដោយស្វ័យប្រវត្តិ ប្រសិនបើនរណាម្នាក់ព្យាយាមផ្ញើការអញ្ជើញតាមអ៊ីមែលមកអ្នក។",
    "description_13_question_2": "ឆ្លើយតបទៅនឹងសំណួរ ឬការត្អូញត្អែររបស់អ្នក ឬចំពោះការត្អូញត្អែរអំពីការប្រើប្រាស់គេហទំព័ររបស់យើង។ជួយអ្នកឱ្យភ្ជាប់ទំនាក់ទំនងជាមួយសមាជិកផ្សេងទៀត - ឧ. ដោយបង្កើតសំណើសុំមិត្តដោយស្វ័យប្រវត្តិ ប្រសិនបើនរណាម្នាក់ព្យាយាមផ្ញើការអញ្ជើញតាមអ៊ីមែលមកអ្នក។",
    "description_14_question_2": "យើងមានចំណាប់អារម្មណ៍ស្របច្បាប់ក្នុងការប្រើប្រាស់ព័ត៌មានរបស់អ្នកតាមវិធីទាំងនេះ។ វាចាំបាច់សម្រាប់ពួកយើងដើម្បីធ្វើដូច្នេះដើម្បីធ្វើឱ្យសេវាកម្ម និងខ្លឹមសាររបស់យើងពាក់ព័ន្ធនឹងអ្នកតាមដែលអាចធ្វើទៅបាន ហើយនោះជាផលប្រយោជន៍របស់យើងទាំងពីរ។",
    "description_15_question_2": "លើសពីនេះទៀត យើងមានចំណាប់អារម្មណ៍ស្របច្បាប់ក្នុងការរក្សាទំនាក់ទំនងរបស់យើងជាមួយអ្នក ធ្វើឱ្យគេហទំព័រ និងសេវាកម្មរបស់យើងប្រសើរឡើង និងការពារទាំងអ្នក និងអ្នកប្រើប្រាស់ផ្សេងទៀត។",
    "description_16_question_2": "ជាលទ្ធផល យើងប្រើប្រាស់ព័ត៌មានរបស់អ្នកដើម្បី៖",
    "description_17_question_2": "ធ្វើការវិភាគអំពីរបៀបដែលអ្នកប្រើប្រាស់គេហទំព័ររបស់យើង ដើម្បីស្វែងយល់ពីតម្រូវការរបស់អ្នកកាន់តែច្បាស់ និងដើម្បីបង្កើនប្រសិទ្ធភាពសេវាកម្ម និងបទពិសោធន៍របស់យើង។ ជាឧទាហរណ៍ តាមរយៈការវាស់ស្ទង់ពេលវេលាដែលអ្នកចំណាយលើទំព័រជាក់លាក់មួយមុន និងក្រោយការផ្លាស់ប្តូរការរចនា យើងអាចយល់បានថាតើមានអ្វីដែលយើងត្រូវការដើម្បីកែប្រែ។ ដើម្បីធ្វើដូច្នេះបាន យើងប្រើប្រាស់សេវាកម្មភាគីទីបី Google Analytics ដើម្បីប្រមូលព័ត៌មានកំណត់ហេតុអ៊ីនធឺណិតស្តង់ដារ និងព័ត៌មានលម្អិតនៃគំរូអាកប្បកិរិយារបស់អ្នកទស្សនា (ឧទាហរណ៍ តើអ្នកចំណាយពេលប៉ុន្មានក្នុងការអានលទ្ធផលតេស្តបុគ្គលិកលក្ខណៈរបស់អ្នក)។ ប្រសិនបើយើងមានទំនាក់ទំនងអតិថិជនដែលមានស្រាប់ជាមួយអ្នក យើងក៏អាចប្រើ Facebook Pixel ដើម្បីវិភាគប្រសិទ្ធភាពនៃការផ្សាយពាណិជ្ជកម្ម Facebook របស់យើង។ យើងបានរៀបរាប់អំពីសេវាកម្មទាំងនេះរួចហើយនៅក្នុងផ្នែក cookie ខាងលើ។",
    "description_18_question_2": "កែលម្អគេហទំព័ររបស់យើង និងអភិវឌ្ឍមុខងារថ្មី។ ជាឧទាហរណ៍ ប្រសិនបើអ្នកឆ្លើយភាគច្រើននៅក្នុងការស្ទង់មតិរបស់យើងនិយាយថាពួកគេចង់ស្វែងយល់បន្ថែមអំពីការដោះស្រាយជាមួយមិត្តរួមការងារដែលពិបាកនោះ យើងប្រាកដជានឹងគិតពិចារណា។",
    "description_19_question_2": "ធ្វើការវិភាគផ្ទៃក្នុង និងការស្រាវជ្រាវវិទ្យាសាស្ត្រ/ស្ថិតិ ដើម្បីកែលម្អសេវាកម្ម និងការយល់ដឹងអំពីបុគ្គលិកលក្ខណៈរបស់យើង។ ជាឧទាហរណ៍ ការឆ្លើយតបរបស់អ្នកចំពោះការស្ទង់មតិរបស់យើងអាចជួយយើងឱ្យដឹងថាតើ Extraverts ឬ Introverts ទំនងជាជាអ្នកចាប់ផ្តើមដំបូង។ ទិន្នន័យស្រាវជ្រាវឆៅដែលអ្នកផ្តល់គឺអនាមិក ឬក្លែងក្លាយ ហើយការចូលប្រើវាត្រូវបានកំណត់យ៉ាងតឹងរ៉ឹង។ សូម្បីតែអ្នកស្រាវជ្រាវរបស់យើងផ្ទាល់ក៏ឃើញតែទិន្នន័យដែលមិនអាចតភ្ជាប់ត្រឡប់ទៅព័ត៌មានដែលកំណត់អត្តសញ្ញាណបុគ្គលណាមួយបាន ហើយយើងគ្រាន់តែបោះពុម្ពទិន្នន័យស្ថិតិសរុបប៉ុណ្ណោះ។",
    "description_20_question_2": "រក្សាគេហទំព័រឱ្យមានសុវត្ថិភាព និងការពារការក្លែងបន្លំ - ឧ. ដោយការចូលការព្យាយាមផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវ ឬសកម្មភាពដែលទាក់ទងនឹងគណនីរបស់អ្នក។",
    "description_21_question_2": "រក្សាសុវត្ថិភាពទាំងអ្នក និងអ្នកប្រើប្រាស់ផ្សេងទៀត រួមទាំងធ្វើការជាមួយការអនុវត្តច្បាប់ក្នុងករណីចាំបាច់។ ជាឧទាហរណ៍ យើងអាចជូនដំណឹងទៅប៉ូលីស ប្រសិនបើអ្វីមួយដែលអ្នកបានបង្ហោះធ្វើឱ្យយើងជឿថាវាទំនងជាអ្នក ឬនរណាម្នាក់ផ្សេងទៀតកំពុងស្ថិតក្នុងគ្រោះថ្នាក់រាងកាយភ្លាមៗ។",
    "description_22_question_2": "ផ្ទៀងផ្ទាត់ការអនុលោមតាមលក្ខខណ្ឌដែលគ្រប់គ្រងការប្រើប្រាស់គេហទំព័រ ឧ. ដោយពិនិត្យមើលសារឯកជនរបស់អ្នក ប្រសិនបើអ្នកប្រើផ្សេងទៀតត្អូញត្អែរពីការយាយី។",
    "description_23_question_2": "ខណៈពេលដែលផលប្រយោជន៍ស្របច្បាប់របស់យើងគ្របដណ្តប់ជាច្រើននៃអ្វីដែលយើងធ្វើនោះ ក្នុងកាលៈទេសៈខាងក្រោម មូលដ្ឋានច្បាប់ផ្សេងទៀតអនុវត្តចំពោះរបៀបដែលយើងដំណើរការទិន្នន័យផ្ទាល់ខ្លួនរបស់អ្នក៖",
    "description_24_question_2": "ដែលជាកន្លែងដែលយើងទាមទារការយល់ព្រមយ៉ាងច្បាស់លាស់ពីអ្នកសម្រាប់ដំណើរការនៅក្នុងសំណួរ។",
    "description_25_question_2": "ដែលជាកន្លែងដែលយើងផ្តល់សេវាកម្មដល់អ្នកក្នុងនាមជាសមាជិក - ក្នុងករណីនេះយើងនឹងមានកិច្ចសន្យាជាមួយអ្នកសម្រាប់ការនេះ ហើយយើងនឹងដំណើរការទិន្នន័យរបស់អ្នកស្របតាមកិច្ចសន្យារបស់យើងជាមួយអ្នក (សូមមើលលក្ខខណ្ឌរបស់យើង)។ ជាពិសេស កិច្ចសន្យារបស់យើងអនុញ្ញាតឱ្យយើងរក្សាទុក និងលុបទិន្នន័យតាមរបៀបដែលបដិសេធសិទ្ធិមួយចំនួនដែលអ្នកប្រហែលជាមាន ប្រសិនបើយើងពឹងផ្អែកលើការយល់ព្រម ឬផលប្រយោជន៍ស្របច្បាប់របស់យើងសម្រាប់ដំណើរការទិន្នន័យដែលមានសំណួរ។",
    "description_26_question_2": "ដែលជាកន្លែងដែលយើងផ្តល់សេវាកម្មដល់អ្នកក្នុងនាមជាសមាជិក - ក្នុងករណីនេះយើងនឹងមានកិច្ចសន្យាជាមួយអ្នកសម្រាប់ការនេះ ហើយយើងនឹងដំណើរការទិន្នន័យរបស់អ្នកស្របតាមកិច្ចសន្យារបស់យើងជាមួយអ្នក (សូមមើលលក្ខខណ្ឌរបស់យើង)។ ជាពិសេស កិច្ចសន្យារបស់យើងអនុញ្ញាតឱ្យយើងរក្សាទុក និងលុបទិន្នន័យតាមរបៀបដែលបដិសេធសិទ្ធិមួយចំនួនដែលអ្នកប្រហែលជាមាន ប្រសិនបើយើងពឹងផ្អែកលើការយល់ព្រម ឬផលប្រយោជន៍ស្របច្បាប់របស់យើងសម្រាប់ដំណើរការទិន្នន័យដែលមានសំណួរ។",
    "description_27_question_2": "ដែលជាកន្លែងដែលមានមូលដ្ឋានច្បាប់មួយផ្សេងទៀតអនុវត្ត (ដែលនឹងកម្រ) - ឧ. ដើម្បីការពារផលប្រយោជន៍សំខាន់ៗរបស់អ្នក ឬបុគ្គលផ្សេងទៀត ឬកន្លែងដែលយើងតម្រូវឱ្យដំណើរការព័ត៌មានដោយច្បាប់។"
  },

 
  


  "TestMainPage": {
    "typeOfQuizKh": {
      "title": "ជ្រើសរើសប្រភេទតេស្ត",
      "description": "ដោយផ្អែកលើប្រភេទតេស្តដែលអ្នកបានជ្រើសរើស អ្នកនឹងទទួលបានលទ្ធផលទៅលើការណែនាំពី អាជីពការងារ ជំនាញដែលគួរជ្រើសរើសនិងស្គាល់ពី ខ្លួនឯងកាន់តែប្រសើរជាងមុន។"
    },
    "introKh": {
      "title": "តេស្តស្វែងរក",
      "highlight": "អាជីពការងារ",
      "description": "ការជ្រើសរើសអាជីពការងារត្រឹមត្រូវអាចជាបញ្ហាប្រឈមប៉ុន្តែការយល់ដឹងពីខ្លួនអ្នកគឺជាជំហានដំបូងឆ្ពោះទៅរកការស្វែងរកអាជីពដែលសាកសមនឹងអ្នក។កម្រងសំណួរនេះត្រូវបានរចនាឡើងដើម្បីជួយអ្នកស្វែងយល់ពីភាពខ្លាំងខ្សោយ ចំណាប់អារម្មណ៍ របៀបនៃការសិក្សា គុណតម្លៃនិងបុគ្គលិកលក្ខណៈ​របស់អ្នក រួចផ្តល់ជាយោបល់លើអាជីពការងារនិងជំនាញដែលត្រូវសិក្សាដែលអ្នកគួរពិចារណា។"
    },
    "instructKh": {
      "instructionLabel": "ការណែនាំ",
      "howItWorksTitle": "របៀបក្នុងការធ្វើតេស្ត",
      "representedImageTitle": "រូបតំណាង",
      "howItWorksSteps": {
        "step1": "ចុចលើរូបតំណាងសម្រាប់បង្ហាញពីកម្រិតនៃការយល់ស្របទៅលើសំណួរនីមួយៗរបស់អ្នកដោយភាពស្មោះត្រង់ និងយកចិត្តទុកដាក់។",
        "step2": "បន្ទាប់ពីតេស្តរួចរាល់ អ្នកនឹងទទួលបានលទ្ធផលដែលណែនាំអ្នកពី ជំនាញដែលត្រូវសិក្សា​ និងអាជីពការងារ​ដែលសាកសមនឹងអ្នក។"
      },
      "emojiLabels": {
        "stronglyDisagree": "មិនឯកភាពទាំងស្រុង",
        "disagree": "មិនឯកភាព",
        "neutral": "ឯកភាពខ្លះមិនឯកភាពខ្លះ",
        "agree": "ឯកភាព",
        "stronglyAgree": "ឯកភាពទាំងស្រុង"
      },
      "personalityMain": {
        "title": "តេស្តវាយតម្លៃតាមបុគ្គលិកលក្ខណៈ",
        "desc": "យល់ដឹងពីប្រភេទបុគ្គលិកលក្ខណៈរបស់អ្នកតាមរយះ MBTI (Myers-Briggs Type Indicator) បង្កើតឡើងដោយលោក Carl Jung",
        "route": "personality"
      },
      "interestMain": {
        "title": "តេស្តវាយតម្លៃតាម​ចំណាប់អារម្មណ៍",
        "desc": "យល់ដឹងពីចំណាំអារម្មណ៍របស់អ្នកតាមរយះ Holland Theory បង្កើតឡើងដោយលោក John Holland ",
        "route": "interest"
      },
      "learningStyleMain": {
        "title": "តេស្តវាយតម្លៃតាមរបៀបសិក្សា",
        "desc": "យល់ដឹងពីរបៀបនៃការសិក្សារបស់អ្នកតាមរយះ VARY Theory បង្កើតឡើងដោយលោក Neil Fleming ",
        "route": "learningStyle"
      },
      "skillMain": {
        "title": "តេស្តវាយតម្លៃតាមភាពខ្លាំងខ្សោយ",
        "desc": "វាយតម្លៃពីភាពខ្លាំងខ្សោយនៃជំនាញកំពុងតម្រូវការ សម្រាប់ការងារនាពេលបច្ចុប្បន្នដោយផ្អែកលើការកំណត់នៅក្នុង O*NET​ Database​ ",
        "route": "skill"
      },
      "valueMain": {
        "title": "តេស្តវាយតម្លៃតាមគុណតម្លៃ",
        "desc": "យល់ដឹងពីគុណតម្លៃការងាររបស់អ្នកតាមរយះSchwartz Value Theory  បង្កើតឡើងដោយលោក Shalom​​ Schwartz  ",
        "route": "value"
      },
      "allMain": {
        "title": "តេស្តគ្រប់ការវាយតម្លៃទាំងអស់",
        "desc": "តេស្តលើគ្រប់ការវាយតម្លៃដើម្បីទទួលបានលទ្ធផលសរុប ​MBTI, Holland theory, VARY Theory, Schwartz Value Theory ",
        "route": "all"
      }
    }
  },
  "LearningStyleTest": {
    "learningStyle_intro_title": "តេស្តវាយតម្លៃតាម",
    "learningStyle_intro_highlight": "របៀបសិក្សា",
    "learningStyle_intro_description": "ដោយផ្អែកលើប្រភេទតេស្តនេះ អ្នកនឹងទទួលបានលទ្ធផលពីរបៀបនៃការសិក្សារបស់អ្នកតាមរយះ VARY Theory បង្កើតឡើងដោយលោក Neil Fleming  និងការណែនាំពីអាជីពការងារ ជំនាញដែលគួរជ្រើសរើសកាន់តែប្រសើរជាងមុន",
    "question_1": "ខ្ញុំយល់ពីព័ត៌មានណាមួយនៅពេលដែលវាបង្ហាញដោយប្រើដ្យាក្រាម គំនូសតាង ឬវីដេអូ។",
    "question_2": "ការប្រើកូដពណ៌ ឬគំនូសតាងនានាជួយខ្ញុំក្នុងការរៀបចំ និងរំលឹកព័ត៌មានឡើងវិញបានល្អប្រសើរជាងមុន។",
    "question_3": "ការរៀនរបស់ខ្ញំុមានប្រសិទ្ធិភាពជាងមុននៅពេលមាននរណាម្នាក់ពន្យល់ដល់ខ្ញំុ។",
    "question_4": "ការពិភាក្សាជាក្រុម ឬការដោះដូរគំនិតគ្នាជួយខ្ញុំឱ្យយល់ព័ត៌មានបានប្រសើរជាងមុន។",
    "question_5": "ខ្ញុំចូលចិត្តការរៀនដោយការអាន ឬតាមការកត់ចំណាំ។",
    "question_6": "ការសរសេរសង្ខេប ឬបំបែកជាផ្នែកតូចៗជួយឲ្យខ្ញុំទទួលបានព័ត៌មានបានល្អប្រសើរ។",
    "question_7": "ការរៀនរបស់ខ្ញំុមានប្រសិទ្ធិភាពជាងមុនដោយការអនុវត្តន៍ដោយផ្ទាល់ ឬការធ្វើពិសោធន៍",
    "question_8": "ការអនុវត្តន៍ឧទាហរណ៍ជាក់ស្ដែង ឬដោយប្រើប្រាស់សម្ភារៈជួយឱ្យខ្ញុំយល់ដឹងពីដំណើរការបានល្អប្រសើរជាងមុន។"
  },
  "PersonalityTest": {
    "Personality_intro_title": "តេស្តវាយតម្លៃតាម",
    "Personality_intro_highlight": "បុគ្គលិកលក្ខណៈ",
    "Personality_intro_description": "ដោយផ្អែកលើប្រភេទតេស្តនេះ អ្នកនឹងទទួលបានលទ្ធផលពីប្រភេទបុគ្គលិកលក្ខណៈរបស់អ្នកតាមរយះ MBTI (Myers-Briggs Type Indicator) បង្កើតឡើងដោយលោក Carl Jung និងការណែនាំពីអាជីពការងារ ជំនាញដែលគួរជ្រើសរើសកាន់តែប្រសើរជាងមុន។",
    "question_1": "ខ្ញុំចូលចិត្តចំណាយពេលនៅម្នាក់ឯងដើម្បីស្ដារថាមពលឡើងវិញ។",
    "question_2": "ខ្ញុំមានអារម្មណ៍ល្អនៅពេលដែលខ្ញុំស្ថិតនៅក្នុងចំណោមមនុស្សតិចជាជាងនៅក្នុងចំណោមមនុស្សច្រើន។",
    "question_3": "ខ្ញុំមានអារម្មណ៏ថាទទួលបានការលើកទឹកចិត្តនិងមានភាពរីករាយនៅពេលដែលខ្ញុំធ្វើទំទាក់ទងជាមួយក្រុមមនុស្សថ្មីៗ។",
    "question_4": "ខ្ញុំចូលចិត្តការងារសង្គមនិងចូលរួមជាមួយអ្នកដទៃជាងចំណាយពេលនៅម្នាក់ឯង។",
    "question_5": "ខ្ញុំផ្តោតលើភាពពិតជាក់ស្តែងនិងមានការពិសោធន៍ច្បាស់លាស់ជាជាងការសញ្ជឹងគិតតែទៅលើទ្រីស្តី។",
    "question_6": "ខ្ញុំចូលចិត្តដោះស្រាយបញ្ហាដោយការអនុវត្តជាក់ស្តែងជាជាងការពឹងផ្អែកលើទ្រឹស្ដីឬគំនិតណាមួយដែលមិនមានមូលដ្ឋានច្បាស់លាស់។",
    "question_7": "ខ្ញុំច្រើនគិតអំពីអនាគតនិងស្រមើលស្រមៃពីលទ្ធភាពដែលមិនទាន់កើតមាន។",
    "question_8": "ខ្ញុំពឹងផ្អែកលើអារម្មណ៍ឬការសន្មត់ខ្លួនឯងនៅពេលធ្វើការសម្រេចចិត្ត។",
    "question_9": "ខ្ញុំពឹងផ្អែកលើការពិត និងតក្កវិជ្ជាដើម្បីដោះស្រាយបញ្ហាជាជាងការប្រើអារម្មណ៍ផ្ទាល់ខ្លួន។",
    "question_10": "ខ្ញុំយល់ថាការផ្តោតលើភាពយុត្តិធម៌និងស្មើភាពគ្នាសំខាន់ជាងមនោសញ្ជេតនា",
    "question_11": "ខ្ញុំឱ្យតម្លៃលើភាពសុខដុមរមនា ហើយព្យាយាមរក្សាទំនាក់ទំនងល្អជាមួយអ្នកដែលនៅជុំវិញខ្លួន។",
    "question_12": "ខ្ញុំពិចារណាពីផលប៉ះពាល់វិជ្ជមានឬអវិជ្ជមានចំពោះអារម្មណ៏អ្នកដ៏ទៃនៅពេលដែលខ្ញុំសម្រេចចិត្តធ្វើរឿងអ្វីមួយ។",
    "question_13": "ខ្ញុំចូលចិត្តរៀបចំផែនការការងារប្រចាំថ្ងៃអោយមានរបៀបរៀបរយទៅតាមកាលវិភាគដែលបានកំណត់។",
    "question_14": "ខ្ញុំចូលចិត្តធ្វើសេចក្តីសម្រេចចិត្តយ៉ាងឆាប់រហ័សនិងជៀសវាងការផ្លាស់ប្តូរកាលវិភាគលើវិនាទីចុងក្រោយ។",
    "question_15": "ខ្ញុំចូលចិត្តធ្វើការងារទាំងឡាយណាដែលមានភាពបត់បែននិងមានឯករាជ្យភាពជាជាងការធ្វើការងារដែលមានផែនការជាក់លាក់ឬតឹងរ៉ឹង",
    "question_16": "ខ្ញុំមានភាពបត់បែន និងបើកចិត្តទូលាយ​ និង​មិន​ចូល​ចិត្ត​ប្រញាប់​ប្រញាល់​ក្នុង​ការ​សម្រេច​ចិត្ត ហើយ​ចូល​ចិត្ត​ស្វែង​រក​លទ្ធភាព​ផ្សេង​ៗ​មុន​នឹង​ជ្រើស​រើស​ជម្រើស​ល្អ​បំផុត។"
  },
  "InterestTest": {
    "interest_intro_title": "តេស្តវាយតម្លៃតាម",
    "interest_intro_highlight": "ចំណាប់អារម្មណ៍",
    "interest_intro_description": "ដោយផ្អែកលើប្រភេទតេស្តនេះ អ្នកនឹងទទួលបានលទ្ធផលពីចំណាប់អារម្មណ៍របស់អ្នកតាមរយះ Holland Theory​ បង្កើតឡើងដោយលោក John Holland  និងការណែនាំពីអាជីពការងារ ជំនាញដែលគួរជ្រើសរើសកាន់តែប្រសើរជាងមុន។",
    "question_1": "ខ្ញុំចូលចិត្តធ្វើការដោយប្រើឧបករណ៍ ឬម៉ាស៊ីនជំនួយដើម្បីដោះស្រាយបញ្ហា។",
    "question_2": "ខ្ញុំចូលចិត្តការងារហត្ថកម្មជាងការងារដែលប្រើបញ្ញាច្រើន។",
    "question_3": "ខ្ញុំចូលចិត្តដោះស្រាយបញ្ហាស្មុគស្មាញដែលតម្រូវឲ្យ​មានការគិតពិចារណានិងការស្រាវជ្រាវខ្ពស់។",
    "question_4": "ខ្ញុំចាប់អារម្មណ៍ក្នុងការវិភាគទិន្នន័យនិងធ្វើពិសោធន៍ជាងការធ្វើការជាមួយមនុស្ស។",
    "question_5": "ខ្ញុំរីករាយក្នុងការបង្ហាញពីអារម្មណ៍ខ្លួនឯងតាមសកម្មភាពសិល្បៈដូចជាការគូរគំនូរ​ និពន្ធ ឬតន្ត្រី។",
    "question_6": "ខ្ញុំ​ចូលចិត្តបង្កើតអ្វីដែលថ្មី ដូចជាការរចនាគេហទំព័រ ឬនិពន្ធរឿង។",
    "question_7": "ខ្ញុំរីករាយក្នុងការជួយ និងផ្តល់ការលើកទឹកចិត្តដល់អ្នកដទៃ។",
    "question_8": "ខ្ញុំចូលចិត្តនៅក្នុងចំណោមមនុស្ស​ និងធ្វើការងារជាក្រុមជាងធ្វើការតែម្នាក់ឯង។",
    "question_9": "ខ្ញុំរីករាយក្នុងការជំរុញអ្នកដទៃក្នុងការធ្វើសកម្មភាពណាមួយឬសាកល្បងអ្វីដែលថ្មី។",
    "question_10": "ខ្ញុំចូលចិត្តធ្វើជាអ្នកដឹកនាំនិងការសម្រេចចិត្តដែលជះឥទ្ធិពលដល់អ្នកដទៃ។",
    "question_11": "ខ្ញុំចូលចិត្តអនុវត្តន៍ច្បាប់ និងធ្វើការក្នុងកន្លែងដែលមានរចនាសម្ព័ន្ធច្បាស់លាស់។",
    "question_12": "ខ្ញុំរីករាយក្នុងការធ្វើការជាមួយតួលេខ រៀបចំទិន្នន័យ និងគ្រប់គ្រងប្រព័ន្ធ។"
  },
  "SkillTest": {
    "skill_intro_title": "តេស្តវាយតម្លៃតាម",
    "skill_intro_highlight": "ភាពខ្លាំងខ្សោយ",
    "skill_intro_description": "ដោយផ្អែកលើប្រភេទតេស្តនេះ អ្នកនឹងទទួលបានលទ្ធផលពីភាពខ្លាំងខ្សោយរបស់អ្នកនៃជំនាញកំពុងតម្រូវការសម្រាប់ការងារ នាពេលបច្ចុប្បន្នដោយផ្អែកលើការកំណត់នៅក្នុង O*NET​ Database​ និងការណែនាំពីអាជីពការងារ ជំនាញដែលគួរជ្រើសរើសកាន់តែប្រសើរជាងមុន។",
    "question_1": "នៅពេលប្រឈមមុខនឹងបញ្ហាលំបាក ខ្ញុំស្វែងរកវិធីផ្សេងៗដើម្បីដោះស្រាយបញ្ហា។",
    "question_2": "ខ្ញុំតែងតែថ្លឹងថ្លែងពីទស្សនៈផ្សេងៗ មុននឹងធ្វើការសម្រេចចិត្ត។",
    "question_3": "ខ្ញុំអាចអនុវត្តគណិតវិទ្យាបានយ៉ាងងាយស្រួលក្នុងការដោះស្រាយស្ថានភាពប្រចាំថ្ងៃ។",
    "question_4": "ខ្ញុំរីករាយក្នុងការដោះស្រាយបញ្ហាបែបវិទ្យាសាស្ត្រតាមរយៈការធ្វើពិសោធន៍និងស្រាវជ្រាវ។",
    "question_5": "ខ្ញុំអាចផ្លាស់ប្តូរវិធីសាស្ត្ររៀនរបស់ខ្ញុំ ទៅតាមមុខវិជ្ជាឬភារកិច្ចដែលត្រូវអនុវត្ត។",
    "question_6": "ជារឿយៗខ្ញុំតែងតែតាមដានដំណើរការរបស់ខ្ញុំនៅពេលធ្វើការលើគម្រោងណាមួយ។",
    "question_7": "ខ្ញុំស្តាប់យ៉ាងយកចិត្តទុកដាក់ និងព្យាយាមយល់ពីទស្សនៈរបស់អ្នកដទៃ មុននឹងឆ្លើយតប។",
    "question_8": "ខ្ញុំអាចដឹងពីស្ថានភាពនៃអារម្មណ៍របស់អ្នកដទៃបានយ៉ាងងាយស្រួលតា​មសកម្មភាព ឬការនិយាយស្ដីរបស់ពួកគេ។",
    "question_9": "ជារឿយៗខ្ញុំតែងតែពិចារណាលើកត្តាផ្សេងៗ មុននឹងធ្វើការសម្រេចចិត្តលើអ្វីដែលសំខាន់។",
    "question_10": "ខ្ញុំអាចបង្រៀនឬណែនាំអ្នកដទៃដើម្បីជួយពួកគេក្នុងការសិក្សាអ្វីដែលថ្មី។",
    "question_11": "ខ្ញុំតែងតែស្វែងរកជំនាញ និងចំណេះដឹងថ្មីៗ ដើម្បីអភិវឌ្ឍខ្លួនឯងឪ្យប្រសើរឡើងជាងមុន។",
    "question_12": "ខ្ញុំអាចរៀបចំពេលវេលារបស់ខ្ញុំឲ្យមានប្រសិទ្ធភាព ដើម្បីបញ្ចប់កាលកំណត់។",
    "question_13": "ខ្ញុំអាចរៀបចំការគិតរបស់ខ្ញុំបានច្បាស់លាស់និងត្រឹមត្រូវតាមរយះការសរសេរ។",
    "question_14": "ខ្ញុំមានទំនុកចិត្តក្នុងការនិយាយនៅមុខអ្នកដទៃនិងទស្សកជនជាច្រើន។",
    "question_15": "ខ្ញុំអាចអានយល់នូវឯកសារដែលស្មុគស្មាញនិងសង្ខេបចំណុចសំខាន់ៗយ៉ាងមានប្រសិទ្ធិភាព។"
  },
  "ValueTest": {
    "value_intro_title": "តេស្តវាយតម្លៃតាម​",
    "value_intro_highlight": "គុណតម្លៃ",
    "value_intro_description": "ដោយផ្អែកលើប្រភេទតេស្តនេះ អ្នកនឹងទទួលបានលទ្ធផលពីគុណតម្លៃរបស់អ្នកតាមរយះ Schwartz Value Theory បង្កើតឡើងដោយលោក Shalom​​ Schwartz  និងការណែនាំពីអាជីពការងារ ជំនាញដែលគួរជ្រើសរើសកាន់តែប្រសើរជាងមុន។",
    "question_1": "ខ្ញុំឲ្យតម្លៃទៅលើការងារទាំងឡាយណាដែលកាលវិភាគមានភាពបត់បែន។",
    "question_2": "ការរក្សាតុល្យភាពរវាងការងារជាមួយនឺងជីវិតផ្ទាល់ខ្លួនគឺមានសារៈសំខាន់សម្រាប់ខ្ញុំ។",
    "question_3": "ការទទួលបានប្រាក់ខែខ្ពស់គឺជាអាទិភាពសំខាន់សម្រាប់ខ្ញុំ។",
    "question_4": "ការដែលមានសុវត្ថិភាពនៅកន្លែងការងារគឺជារឿងអត្ថិភាពចម្បងសម្រាប់ខ្ញុំ។",
    "question_5": "ខ្ញុំពេញចិត្តចំពោះការងារទាំងឡាយណាដែលលើកទឹកចិត្តក៏ដូចជាជំរុញឲ្យមានការគិតបែបច្នៃប្រឌិត។",
    "question_6": "ខ្ញុំ​ចូលចិត្តការងារដែលទាមទារការច្នៃប្រឌិតនិងដោះស្រាយបញ្ហាថ្មីៗជាជាងការធ្វើតាមជំហានដដែលៗជារៀងរាល់ថ្ងៃ។",
    "question_7": "ខ្ញុំមានអារម្មណ៍ល្អនៅពេលខ្ញុំបានបំពេញការងារដែលបានជួយដល់អ្នកនៅជុំវិញខ្លួន។",
    "question_8": "ខ្ញុំចូលចិត្តការងារដែលអាចជួយដល់បុគ្គលឬសហគមន៍ដែលត្រូវការជំនួយ។",
    "question_9": "ខ្ញុំរក្សានូវគោលជំហក្នុងការសិក្សារៀនសូត្រនិងការអភិវឌ្ឍន៍ជំនាញឥតឈប់ឈរសម្រាប់ជំនាញអាជីពរបស់ខ្ញុំ។",
    "question_10": "ខ្ញុំស្វែងរកបញ្ហាប្រឈមដែលអនុញ្ញាតឱ្យខ្ញុំរីកចម្រើន និងពង្រីកសមត្ថភាពរបស់ខ្ញុំ។",
    "question_11": "ការកោតសរសើរពីមិត្តរួមការងារ ឬរង្វាន់សម្រាប់ការខិតខំប្រឹងប្រែងគឺមានសារៈសំខាន់សម្រាប់ខ្ញុំ។",
    "question_12": "ការទទួលបានភាពជោគជ័យក្នុងអាជីពរបស់ខ្ញុំគឺជាការកម្លាំងចិត្តចំពោះខ្ញុំ។",
    "question_13": "ខ្ញុំចង់អោយការងាររបស់ខ្ញុំអាចមានឥទ្ធិពលវិជ្ជមានចំពោះសង្គម។",
    "question_14": "ការធ្វើអោយមានការផ្លាស់ប្តូរដល់ពិភពលោកគឺជាកម្លាំងចិត្តសំខាន់សម្រាប់ខ្ញុំ។",
    "question_15": "ខ្ញុំ​ឱ្យ​តម្លៃ​លើ​សមត្ថភាព​ក្នុង​ការ​សម្រេច​ចិត្ត​នៅ​ក្នុង​ការងារ​របស់​ខ្ញុំ។",
    "question_16": "មានការគ្រប់គ្រងលើកាលវិភាគការងាររបស់ខ្ញុំគឺមានភាពចាំបាច់សម្រាប់ខ្ញុំ។",
    "question_17": "ខ្ញុំចូលចិត្តការងារដែលមានស្ថេរភាព ជាមួយនឹងទំនួលខុសត្រូវ។",
    "question_18": "សុវត្ថិភាពនៅកន្លែងការងារគឺសំខាន់សម្រាប់ខ្ញុំជាងការរីកចម្រើននៃការងារ។",
    "question_19": "ខ្ញុំរីករាយនឹងការធ្វើការងារជាក្រុមដើម្បីសម្រេចបាននូវគោលដៅរួម។",
    "question_20": "ការកសាងទំនាក់ទំនងដ៏រឹងមាំគឺមានសារៈសំខាន់សម្រាប់ខ្ញុំ។",
    "question_21": "ខ្ញុំរីករាយក្នុងការទទួលយកតួនាទីជាអ្នកដឹកនាំនៅក្នុងការកំណត់ក្រុម។",
    "question_22": "ខ្ញុំចូលចិត្តការណែនាំអ្នកដទៃ។"
  },
  "AllTest": {
    "allTest_intro_title": "តេស្តគ្រប់ការវាយ",
    "allTest_intro_highlight": "តម្លៃទាំងអស់",
    "allTest_intro_description": "ដោយផ្អែកលើប្រភេទតេស្តនេះ អ្នកនឹងទទួលបានលទ្ធផលពីប្រភេទបុគ្គលិកលក្ខណៈ ចំណាំអារម្មណ៍ ភាពខ្លាំងខ្សោយ​ គុណតម្លៃ  របៀបនៃការសិក្សរបស់អ្នក​ និងការណែនាំពីអាជីពការងារ ជំនាញដែលគួរជ្រើសរើសកាន់តែប្រសើរជាងមុន។"
  },
  "SideBarProfile": {
    "menuItems": {
      "testHistory": {
        "title": "ប្រវត្តិតេស្ត",
        "description": "ចូលមើលប្រវតិ្តនៃការតេស្តរបស់អ្នក"
      },
      "draftTest": {
        "title": "តេស្តពេលក្រោយ",
        "description": "ចូលមើលតេស្តសម្រាប់ធ្វើពេលក្រោយ"
      },
      "bookmarks": {
        "title": "ការរក្សាទុក",
        "description": "ចូលមើលការរក្សាទុករបស់អ្នក"
      },
      "aboutYou": {
        "title": "អំពីអ្នក",
        "description": "ចូលកែប្រែប្រូហ្វាល់របស់អ្នក"
      },
      "logout": {
        "title": "ចាកចេញ",
        "description": "ចាកចេញពីគណនីរបស់អ្នក"
      }
    },
    "modalLogout": {
      "title": "បញ្ចាក់ការចាកចេញ",
      "description": "តើអ្នកពិតជាចង់ចាកចេញមែនទេ?",
      "confirm": "ចាកចេញ",
      "cancel": "មិនចាកចេញទេ"
    },
    "toastMessages": {
      "profileImage": {
        "success": "រូបប្រូហ្វាល់របស់អ្នកត្រូវបានកែប្រែជោគជ័យ",
        "error": "បរាជ័យក្នុងការកែប្រែរូបភាព។ សាកល្បងម្តងទៀត។",
        "sizeError": "ទំហំរូបភាពដែលអ្នកអាចបញ្ជូលបានត្រឹមតែ 5 MB ទេ។"
      },
      "logout": {
        "success": "បានចាកចេញជោគជ័យ។",
        "error": "Failed to log out. Please try again.",
        "genericError": "An error occurred during logout."
      }
    }
  },
  "ProfileAboutUser": {
    "form": {
      "fields": {
        "username": {
          "label": "ឈ្មោះ",
          "placeholder": "បញ្ជូលឈ្មោះរបស់អ្នក"
        },
        "password": {
          "label": "ពាក្យសម្ងាត់",
          "placeholder": "••••••••",
          "button": "ផ្លាស់ប្តូរ"
        },
        "date_of_birth": {
          "label": "ថ្ងៃ ខែ ឆ្នាំ​ កំណើត"
        },
        "gender": {
          "label": "ភេទ",
          "placeholder": "ជ្រើសរើសភេទ",
          "selectFemale": "Female",
          "male": "Male"
        },
        "phone_number": {
          "label": "លេខទូរស័ព្ទ",
          "placeholder": "បញ្ជូលលេខទូរស័ព្ទរបស់អ្នក"
        },
        "address": {
          "label": "អាសយដ្ឋាន",
          "placeholder": "បញ្ជូលអាសយដ្ឋានរបស់អ្នក"
        },
        "bio": {
          "label": "អំពីអ្នក",
          "placeholder": "ព័ត៌មានរបស់អ្នក"
        }
      },
      "buttons": {
        "submit": {
          "default": "កែប្រែប្រូហ្វាល់",
          "loading": "កំពុងកែប្រែប្រូហ្វាល់"
        }
      },
      "submitting":{
        "text":"រក្សាទុកការផ្លាស់ប្តូរ",
        "cancel": "មិនរក្សាទុកការផ្លាស់ប្តូរ"
      }
    },
    "ChangePassword": {
      "heading": "បង្កើតពាក្យសម្ងាត់ថ្មី",
      "form": {
        "fields": {
          "old_password": {
            "label": "ពាក្យសម្ងាត់ចាស់",
            "placeholder": "បញ្ជូលពាក្យសម្ងាត់ចាស់របស់អ្នក",
            "error": "អ្នកត្រូវបញ្ជូលពាក្យសម្ងាត់ចាស់"
          },
          "new_password": {
            "label": "ពាក្យសម្ងាត់ថ្មី",
            "placeholder": "បញ្ជូលពាក្យសម្ងាត់ថ្មីរបស់អ្នក",
            "min": "ពាក្យសម្ងាត់ថ្មីគឺខ្លីពេក, សូមបញ្ជូលអោយបាន 8 តួរ",
            "error": "អ្នកត្រូវបញ្ជូលពាក្យសម្ងាត់ថ្មី",
            "pattern": "ពាក្យសម្ងាត់របស់អ្នកត្រូវតែមានអក្សរធំ អក្សរតូច និង​និមិត្តសញ្ញាពិសេស",
            "required": "ពាក្យសម្ងាត់ថ្មីត្រូវតែបញ្ជូល"
          },
          "confirm_new_password": {
            "label": "បញ្ជាក់ពាក្យសម្ងាត់ថ្មី",
            "placeholder": "បញ្ជាក់ពាក្យសម្ងាត់ថ្មីរបស់អ្នក",
            "error": "បញ្ជាក់ពាក្យសម្ងាត់ថ្មីរបស់អ្នកមិនត្រឹមត្រូវ",
            "match": "ពាក្យសម្ងាត់ថ្មីត្រូវតែដូចជាមួយការបញ្ជាក់ពាក្យសម្ងាត់",
            "required": "អ្នកត្រូវបញ្ជូលបញ្ជាក់ពាក្យសម្ងាត់របស់អ្នក"
          }
        },
        "buttons": {
          "submit": {
            "text": "ផ្លាស់ប្តូរ",
            "loading": "ផ្លាស់ប្តូរ..."
          },
          "cancel": {
            "text": "មិនផ្លាស់ប្តូរ"
          }
        }
      },
      "notifications": {
        "success": "ពាក្យសម្ងាត់ថ្មីរបស់អ្នកត្រូវបានផ្លាស់ប្តូរេជោគជ័យ។",
        "error": "Failed to change your password. Please try again."
      }
    },
    "title": "ព័ត៌មានទូទៅ"
  },
  "TestHistoryUser": {
    "title": "ប្រវត្តិនៃការតេស្ត",
    "TestAction": {
      "view": "ចូលមើលលំអិត",
      "copy": "ចម្លង",
      "delete": "លុប"
    },
    "test-placehoder": {
      "title": "គ្មានប្រវត្តិតេស្ត",
      "description": "សាកល្បងធ្វើតេស្តដើម្បីចាប់ផ្តើមតាមដានលទ្ធផលរបស់អ្នក",
      "now": "ឥឡូវនេះ"
    },
    "DeleteTestModal": {
      "heading": "បញ្ជាក់ការលុបនេះ",
      "description": "សូមធ្វើការបញ្ជាក់តើអ្នកពិតជាចង់លុប",
      "confirm": "លុប",
      "cancel": "ទេ"
    },
    "ShareResultPopup": {
      "heading": "ចែករំលែកលទ្ធផល",
      "colorHeading": "តេស្តរបស់អ្នក",
      "subHeading": "អនុញ្ញាតឱ្យគ្រួសារនិងមិត្តភក្តិរបស់អ្នកអាចមើលឃើញពីលទ្ធផលរបស់អ្នកដោយការចែករំលែកតំណភ្ជាប់នេះ",
      "loadingMessage": "Loading...",
      "inputPlaceholder": "http://example.com/link/to/document",
      "buttons": {
        "cancel": "ទេ",
        "share": {
          "default": "ចែករំលែក",
          "shared": "បានចែករំលែក"
        }
      }
    }
  },
  "DraftHistory": {
    "title": "ប្រវត្តិនៃការតេស្តពេលក្រោយ",
    "DraftAction": {
      "view": "ចូលមើលលំអិត",
      "delete": "លុប"
    },
    "DeleteDraftModal": {
      "heading": "បញ្ជាក់ការលុបនៃតេស្តពេលក្រោយរបស់អ្នក",
      "description": "តើអ្នកពិតជាចង់លុបតេស្តពេលក្រោយនេះ",
      "confirm": "លុប",
      "cancel": "ទេ"
    },
    "draft-placehoder": {
      "title": "គ្មានប្រវត្តិនៃការតេស្តពេលក្រោយទេ",
      "description": "សាកល្បងធ្វើតេស្តដើម្បីចាប់ផ្តើមតាមដានលទ្ធផលរបស់អ្នក"
    }
  },
  "BookmarkHistory": {
    "title": "ប្រវត្តិនៃការរក្សាទុកការងាររបស់អ្នក",
    "BookmarkAction": {
      "view": "ចូលមើលលំអិត",
      "delete": "លុប"
    },
    "DeleteBookmarkModal": {
      "heading": "បញ្ជាក់ការលុបនៃការរក្សាទុកការងាររបស់អ្នក",
      "description": "តើអ្នកពិតជាចង់លុបការរក្សាទុកការងារនេះ",
      "confirm": "លុប",
      "cancel": "ទេ"
    },
    "BookMarkHolder": {
      "title": "មិនមានការរក្សាទុកការងារនោះទេ",
      "description": "សាកល្បងធ្វើការរក្សាទុកការងារដែលអ្នកចាប់អារម្មណ៏",
      "now": "ឥឡូវនេះ"
    }
  },
  "Pagination": {
    "page": "ទំព័រទី",
    "of": "នៃ"
  },
  "Login": {
    "left": {
      "title": "សូមស្វាគមន៍មកកាន់គេហទំព័រ E-Found",
      "description": "រកឃើញសក្តានុពល និងស្វែងរកជំនាញឯកទេស នៅសាកលវិទ្យាល័យដែលស្របទៅនឹងចំណង់ចំណូលចិត្ត ចំណុចខ្លាំង និងគោលដៅអាជីពនាពេលអនាគតរបស់អ្នក។"
    },
    "form": {
      "title": "ចូលគណនី",
      "fields": {
        "email": {
          "label": "អ៉ីម៉ែល",
          "placeholder": "បញ្ចូលអ៉ីម៉ែលរបស់អ្នក",
          "error": "អ៉ីម៉ែលរបស់អ្នកមិនត្រឹមត្រូវ"
        },
        "password": {
          "label": "ពាក្យសម្ងាត់",
          "placeholder": "បញ្ចូលពាក្យសម្ងាត់របស់អ្នក",
          "error": "បញ្ចូលពាក្យសម្ងាត់របស់អ្នក"
        },
        "googleaccount": {
          "label": "ភ្ជាប់ជាមួយ Google",
          "textOr": "ឬ"
        }
      },
      "forgotpassword": "ភេ្លចលេខសម្ងាត់?",
      "buttons": "ចូលគណនី",
      "text": "មិនទាន់មានគណនីមែនទេ? ",
      "signup": "បង្កើតគណនី"
    }
  },
  "Register": {
    "left": {
      "title": "សូមស្វាគមន៍មកកាន់គេហទំព័រ E-Found",
      "description": "រកឃើញសក្តានុពល និងស្វែងរកជំនាញឯកទេស នៅសាកលវិទ្យាល័យដែលស្របទៅនឹងចំណង់ចំណូលចិត្ត ចំណុចខ្លាំង និងគោលដៅអាជីពនាពេលអនាគតរបស់អ្នក។"
    },
    "form": {
      "title": "បង្កើតគណនីថ្មី",
      "fields": {
        "username": {
          "label": "ឈ្មោះ",
          "placeholder": "បញ្ចូលឈ្មោះរបស់អ្នក",
          "error": "Name is required."
        },
        "email": {
          "label": "អ៉ីម៉ែល",
          "placeholder": "បញ្ចូលអ៉ីម៉ែលរបស់អ្នក",
          "error": "Email is required."
        },
        "password": {
          "label": "ពាក្យសម្ងាត់",
          "placeholder": "បញ្ចូលពាក្យសម្ងាត់ថ្មី",
          "error": "Password is required."
        },
        "confirmPassword": {
          "label": "បញ្ជាក់ពាក្យសម្ងាត់ ",
          "placeholder": "បញ្ចូលបញ្ជាក់ពាក្យសម្ងាត់ថ្មី",
          "error": "Password confirmation does not match."
        }
      },
      "policyPage": "គោលការណ៍ឯកជនភាព",
      "Or": "ឬ",
      "ContinuewithGoogle": "ភ្ជាប់ជាមួយ Google",
      "agree": "ខ្ញុំបានអាននិងយល់ព្រមលើ",
      "buttons": "បង្កើតគណនី",
      "text": "មានគណនីរួចហើយ?",
      "login": "ចូលគណនី"
    }
  },
  "ForgotPassword": {
    "title": "ភ្លេចពាក្យសម្ងាត់",
    "description": "សូមបញ្ចូលអ៉ីម៉ែល ដើម្បីទទួលបានលេខកូដផ្ទៀងផ្ទាត់",
    "fields": {
      "email": {
        "label": "អ៉ីម៉ែល",
        "placeholder": "បញ្ចូលអ៉ីម៉ែលរបស់អ្នក",
        "error": "Email is required."
      }
    },
    "buttons": "ផ្ញើរលេខសម្ងាត់"
  },
  "ResetPassword": {
    "title": "បង្កើតពាក្យសម្ងាត់ថ្មី",
    "description": "Please input your new password.",
    "fields": {
      "password": {
        "label": "ពាក្យសម្ងាត់ថ្មី",
        "placeholder": "បញ្ចូលពាក្យសម្ងាត់ថ្មី",
        "error": "New Password is required."
      },
      "confirmPassword": {
        "label": "បញ្ជាក់ពាក្យសម្ងាត់ថ្មី",
        "placeholder": "បញ្ចូលបញ្ជាក់ពាក្យសម្ងាត់ថ្មី",
        "error": "Password confirmation does not match."
      }
    },
    "buttons": "រួចរាល់"
  },
  "VerifyCodeForgot": {
    "title": "ផ្ទៀងផ្ទាត់លេខកូដសម្ងាត់",
    "description": "យើងបានផ្ញើលេខកូដ 6 ខ្ទង់ទៅកាន់អ៊ីមែលរបស់អ្នក។​ អ្នកមានពេល",
    "buttons": "ផ្ទៀងផ្ទាត់",
    "time": "វិនាទី",
    "buttonVerifyAgain": "ផ្ញើរលេខកូដសម្ងាត់ម្តងទៀត"
  },
  "VerifyCodeRegister": {
    "title": "ផ្ទៀងផ្ទាត់លេខកូដសម្ងាត់",
    "description": "យើងបានផ្ញើលេខកូដ 6 ខ្ទង់ទៅកាន់អ៊ីមែលរបស់អ្នក។​ អ្នកមានពេល",
    "buttons": "ផ្ទៀងផ្ទាត់",
    "buttonVerifyAgain": "ផ្ញើរលេខកូដសម្ងាត់ម្តងទៀត"
  }
}
