{
  "Navbar": {
    "navLinks": {
      "home": "Home",
      "test": "Tests",
      "university": "University",
      "jobs": "Jobs",
      "privacyPolicy": "Policy",
      "aboutUs": "About us"
    },
    "buttons": {
      "signIn": "Sign in ",
      "khmerLanguage": "Khmer",
      "englishLanguage": "English"
    }
  },
  "HomePage": {
    "heading": {
      "part1": "Discover",
      "part2": " Your Career ",
      "part3": "Today"
    },
    "description": "Choosing the right career path can be challenging, but understanding yourself is the first step towards finding a career that suits you.",
    "getstart": "Get Started",
    "contain": {
      "part1": "Who is",
      "part2": " E-Found",
      "part3": " for?",
      "description": "This website aims to help high school students, university students, and employees to understand themselves and choose the right career path.",
      "stu-high-school": "High school student",
      "stu-university": "University student",
      "Staff-working": "Staff working"
    },
    "featureCard1": {
      "title": "High School Students",
      "description": "High school students can explore their interests and preferred subjects."
    },
    "featureCard2": {
      "title": "University Students",
      "description": "University students who feel like they are choosing the wrong major."
    },
    "featureCard3": {
      "title": "Working Professionals",
      "description": "Professionals who are looking to change careers but are uncertain about their current skills."
    },
    "ConatianFeature": {
      "Feature": "Key Features",
      "features": [
        {
          "title": "Career and Major Counseling",
          "description": "Get tailored guidance about careers and universities that match your personality traits."
        },
        {
          "title": "Discover Talents",
          "description": "Identify your strengths and unique abilities through comprehensive testing."
        },
        {
          "title": "Understanding Careers",
          "description": "Explore how different specializations translate into real-world career opportunities."
        },
        {
          "title": "Converse with AI",
          "description": "Understand your strengths and unique abilities through engaging conversations with AI."
        },
        {
          "title": "Skill Assessment Tests",
          "description": "Uncover your strengths and unique abilities through thorough testing."
        }
      ]
    },

    "trendingJob": {
      "title": "In-Demand Popular Jobs",
      "moreInfo": "Learn more"
    },
    "PopularUniversities": {
      "title": "Popular Educational and Training Institutions",
      "moreInfo": "Learn more"
    },
    "ExpertConsultation": {
      "title": "Consult with our team of experts at",
      "highlight": " E-Found"
    },
    "Consult_with_our_team": {
      "Chen_Phirum": "Chen Phirum",
      "Reksmey-Mom": "Reksmey Mom",
      "Chhaya-Chan": "Chhaya Chan",
      "Keo-KAY": "Keo KAY",
      "role-director": "Director of ISTAD Institute",
      "role-Office": "Head of Academic Office",
      "role-instructor": "Instructor",
      "btn": "Chat Now",
      "Will be available soon": "Will available soon!",
      "description": "We're working hard to bring you something amazing."
    },
    "Process": {
      "title": "The Process of",
      "highlight": " E-Found",
      "description": "Choosing the right career can be challenging, but understanding yourself is the first step towards finding the career that's right for you. To enable E-Found to help guide you in the right direction, please follow these three steps:",
      "steps": [
        {
          "number": "Step1",
          "description-part1": "You can register to access our website using ",
          "description-part2": "email",
          "description-part3": "and",
          "description-part4": "password",
          "description-part5": "Or can be linked to an account",
          "description-part6": "Google",
          "description-part7": ""
        },
        {
          "number": "Step2",
          "description-part1": "To select a test type, you need to click",
          "description-part2": "test",
          "description-part3": "On the Navbar"
        },
        {
          "number": "Step3",
          "description": "You will receive a summary of your results by test type, as well as recommendations for suitable study and career options."
        }
      ]
    },
    "Testimonial": {
      "title": "Testimonial",
      "decision-part1": "Here's what some of our users have to say about ",
      "decision-part2": "E-Found",
      "decision-part3": "After the test"
    }
  },

  "Abbout": {
    "title-1": "Instructions about",
    "title-2": " E-Found",
    "description": "Helping high school students choose their university majors by providing them with opportunities to explore their abilities, interests, and future goals. We accomplish this mission through personality tests, interests, values, strengths, weaknesses, learning styles, and sharing knowledge from various fields.",
    "btn-start": "Get Started",
    "mission": "Our Mission",
    "mission-description": "Our team is committed to providing you with the guidance and support you need to make informed decisions about your future. With our website, you will have the confidence to choose the study path that matches your goals and dreams.",
    "vision": "Our Vision",
    "vision-description": "Become a trusted platform for high school students seeking guidance in choosing academic majors and managing career goals for future success.",
    "our mentors": "Our Instructions",
    "cher-mey": "Reksmey Mom",
    "cher-leang": "Ing Muyleang",
    "team": "Our Team Members"
  },

  "University": {
    "header": "Education and Training Institutions in Cambodia",
    "description": "You can search for the names of various educational and training institutions, as well as information about the skills, locations, tuition fees, and popular majors at each institution.",
    "see-btn": "Let's Started",
    "search": "Search here...",
    "filter-1": "All universities",
    "filter-2": "Phnom Penh",
    "seach-header": "Define your search",
    "PUBLIC": "Public University",
    "PRIVATE": "Private university",
    "TVET": "Technical and vocational training programs",
    "MAJORS_COURSES": "Short courses study programs",
    "Phnom Penh": "Phnom Penh",
    "Battambang": "Battambang",
    "Siem Reap": "Siem Reap",
    "Banteay Meanchey": "Banteay Meanchey",
    "Kampong Cham": "Kampong Cham",
    "Kampong Speu": "Kampong Speu",
    "Kampong Thom": "Kampong Thom",
    "Kampot": "Kampot",
    "Kandal": "Kandal",
    "Koh Kong": "Koh Kong",
    "Kratié": "Kratié",
    "Mondulkiri": "Mondulkiri",
    "Preah Vihear": "Preah Vihear",
    "Prey Veng": "Prey Veng",
    "Pursat": "Pursat",
    "Ratanakiri": "Ratanakiri",
    "Preah Sihanouk": "Preah Sihanouk",
    "Stung Treng": "Stung Treng",
    "Svay Rieng": "Svay Rieng",
    "Takéo": "Takéo",
    "Oddar Meanchey": "Oddar Meanchey",
    "Kep": "Kep",
    "Pailin": "Pailin",
    "Tboung Khmum": "Tboung Khmum",
    "contain-1": "Educational and Training Institutions",
    "not-found": "Your search returned no results",
    "Pagination-page": "page",
    "of": "of",
    "School location": "School location",
    "mission": "Mission",
    "vission": "Vision",
    "see more": "See more",
    "Show Less": "Show Less",
    "abbout-scholl": "About the school",
    "Academic skills": "Academic skills",
    "price": "Price : ",
    "select-faculty": "Select Faculty",
    "Duration": "Duration",
    "hours": "Hours",
    "years": "Years",
    "COURSE": "/Course",
    "Inyears": "/Year",
    "BACHELOR":"Bachelor",
    "ASSOCIATE":"Associate",
    "SHORT_COURSE":"Short Course",
    "MASTER":"Master",
    "PHD":"PHD",
    "Previous":"Previous",
   "Next":"Next"
  },
  "Jobs": {
    "title": "With jobs that are in high demand in the market",
    "desc": "Monitor the job market using our smart tools with data analytics to find trending jobs. We bring you the most in-demand job opportunities to help you plan for a successful future.",
    "highlight": "Step into your future today",
    "search": "Find a job here...",
    "fliter": "Set data",
    "type": "Category",
    "Location": "Place of work",
    "JobType": "Type of work performed",
    "QuizButton": "Reset",
    "job": "Job Opportunities",
    "not-found-1": "No suitable jobs available at this time",
    "not-found-2": "Please try again later",
    "JobBannerCard-title": "Don't know which job is right for you?",
    "JobBannerCard-desc": "Try our assessment test and find potential careers today.",
    "JobBannerCard-buttonText": "Start Test",
    "Apply Now": "Apply Now",
    "categorylabel": "Category Job",
    "timeLabel": "Time Label",
    "locationLabel": "Location",
    "jobDescLabel": "Job Instructions",
    "jobRequirementLabel": "Job Requirements",
    "jobResponseLabel": "Job Role",
    "aboutCompanyLabel": "About the company",
    "websiteLabel": "website",
    "socialLabel": "social"
  },
  "Footer": {
    "description": "E-Found is a website that helps you understand yourself better and effectively seize career opportunities now and in the future.",
    "navigationTitle": {
      "navLinks": "Content",
      "navLinks1": "Home Page",
      "navLinks2": "Tests",
      "navLinks3": "University",
      "navLinks4": "Jobs",
      "navLinks5": "Privacy Policy",
      "navLinks6": "About Us"
    },
    "contactTitle": "Contact Information",
    "contact": {
      "phone": "Phone Number",
      "email": "Email",
      "address": {
        "text": "Beoung Kork 1, Toul Kork, Phnom Penh",
        "label": "Address"
      }
    },
    "sponsoredBy": "Sponsored By",
    "organizedBy": "Organized By",
    "copyright": "Copyright E-Found by",
    "allRightsReserved": ".All rights reserved.™"
  },
  "Policy": {
    "header": "Privacy Policy",
    "dateupdate": "Last updated: February 4, 2024",
    "container": "We have tried to keep this policy as simple and legally compliant as possible to help you understand the information we collect, how we use it, and what choices you have about it. You should read this policy in full, but here is a brief summary of the key points we hope you take away from it:",
    "question_1": "1. How do we collect information?",
    "description_1_question_1": "First, we collect, store, and use the information you share on our website. This includes email addresses, comments, messages sent to other members, and any other information you choose to enter on the website.",
    "description_2_question_1": "If you post personal information of others on our website, you must ensure that you have their consent to disclose and process their personal data in accordance with this privacy policy. That is your responsibility.",
    "description_3_question_1": "Second, if you purchase something for yourself or someone else on our website, we will collect payment and tax information (e.g., country of residence), contact information, and shipping details (e.g., email address), as well as details of what you purchased.",
    "description_4_question_1": "Finally, we log certain technical information when you use our website. This includes information about your device and your interactions with our website, such as your IP address, browser type, and page views.",
    "description_5_question_1": "We also use cookies (small encrypted data files stored and sent by your web browser whenever you visit our website) to store and retrieve your login status, personality test results, and other website settings. Some cookies are account-specific, while others are not. For more information about cookies, please see the section below.",
    "question_2": "2. How do we use the information we collect?",
    "description_1_question_2": "We do not sell your personal data to anyone. Never have, never will.",
    "description_2_question_2": "Everything we know about you is what you share by visiting and interacting with our website. We do not collect your personal data from any third parties, so it is entirely up to you what you choose to share. For example, you can use our website under a pseudonym.",
    "description_3_question_2": "When you use our website, even if you are not logged in, we receive some personal information such as the type of device you are using and your IP address. You can choose to share additional information with us by creating an account. We use this information to improve our services and keep our website functional and secure.",
    "description_4_question_2": "We use your responses to surveys, tests, and other tools to determine which content is relevant to you and to improve our understanding of personality traits. You are completely free to decide which surveys to take and which tools to explore.",
    "description_5_question_2": "If you have any questions or feedback about this policy, please don’t hesitate to contact us!",
    "description_6_question_2": "We use the information we collect to provide you with our services as well as content that is relevant and personalized for you. That’s why it is necessary for us to use your information to:",
    "description_7_question_2": "Send you your personality test results if you request them on the results page or in the settings section.",
    "description_8_question_2": "Send you account-related messages, such as emails to reset your password.",
    "description_9_question_2": "Identify you and ensure the security of your account – for example, by verifying that you are the owner of the email address associated with your account.",
    "description_10_question_2": "Process payments from you and send you emails with details of your purchase if you decide to buy something from us.",
    "description_11_question_2": "Provide you with content and services that are relevant to you – for example, information for people with your personality type.",
    "description_12_question_2": "Help you connect with other members – for example, by automatically generating a friend request if someone tries to invite you via email.",
    "description_13_question_2": "Respond to your questions or complaints about the use of our website.",
    "description_14_question_2": "We have a legitimate interest in using your information in these ways. It is necessary for us to do so to make our services and content as relevant as possible for you, which benefits both of us.",
    "description_15_question_2": "Additionally, we have a legitimate interest in maintaining our relationship with you, improving our website and services, and protecting both you and other users.",
    "description_16_question_2": "As a result, we use your information to:",
    "description_17_question_2": "Analyze how you use our website to better understand your needs and improve our services and experience. For example, by measuring how long you spend on a specific page before and after a design change, we can determine what we need to improve. To do this, we use third-party services such as Google Analytics to collect standard internet log information and details of visitor behavior patterns (e.g., how long you spend reading your personality test results). If we have an existing customer relationship with you, we may also use Facebook Pixel to analyze the effectiveness of our Facebook advertising. We have already described these services in the cookie section above.",
    "description_18_question_2": "Improve our website and develop new features. For example, if most people responding to our surveys say they want to learn more about dealing with difficult coworkers, we will likely consider that.",
    "description_19_question_2": "Conduct internal analysis and scientific/statistical research to improve our services and understanding of personality traits. For example, your survey responses may help us determine whether Extraverts or Introverts are more likely to initiate first. The raw research data you provide is anonymized or pseudonymized, and access to it is strictly controlled. Even our own researchers only see data that cannot be linked back to any specific individual, and we only publish aggregated statistical data.",
    "description_20_question_2": "Keep our website secure and prevent fraud – for example, by logging verification attempts or account-related activities.",
    "description_21_question_2": "Ensure the safety of you and other users, including cooperating with law enforcement when necessary. For example, we may notify the police if something you post leads us to believe you or someone else is in immediate physical danger.",
    "description_22_question_2": "Ensure compliance with the terms governing website usage – for example, by reviewing private messages if another user complains about harassment.",
    "description_23_question_2": "While our legitimate interests cover much of what we do, in the following cases, other legal bases apply to how we process your personal data:",
    "description_24_question_2": "Where we require explicit consent from you for specific processing.",
    "description_25_question_2": "Where we provide you with a service as a member – in this case, we have a contract with you for this purpose, and we process your data in accordance with our contract with you (see our terms of service). Specifically, our contract allows us to retain and delete data in ways that override certain rights you may have if we were relying on consent or our legitimate interests as the legal basis for processing the data in question.",
    "description_26_question_2": "Where we provide you with a service as a member – in this case, we have a contract with you for this purpose, and we process your data in accordance with our contract with you (see our terms of service). Specifically, our contract allows us to retain and delete data in ways that override certain rights you may have if we were relying on consent or our legitimate interests as the legal basis for processing the data in question.",
    "description_27_question_2": "Where another legal basis applies (which is rare) – for example, to protect your vital interests or those of another person, or where we are required to process information by law."
  },
  "TestMainPage": {
    "typeOfQuizKh": {
      "title": "Select test type",
      "description": "Depending on the type of test you choose, you will get results on career and major that you should choose and to get to know yourself better."
    },
    "introKh": {
      "title": "Career ",
      "highlight": "Test",
      "description": "Choosing the right career path can be challenging, but understanding yourself is the first step towards finding the right career for you. This questionnaire is designed to help you understand your strengths, weaknesses, interests, learning style, values ​​and personality, and provide advice on careers and major to study."
    },
    "instructKh": {
      "instructionLabel": "Instructions",
      "howItWorksTitle": "How this Works",
      "representedImageTitle": "Represented Emoji",
      "howItWorksSteps": {
        "step1": "Click on the emoji to indicate how much you agree with each question",
        "step2": "After completing the test, you'll receive results with recommendations for majors and careers that suit you."
      },
      "emojiLabels": {
        "stronglyDisagree": "Strongly Disagree",
        "disagree": "Disagree",
        "neutral": "Neutral",
        "agree": "Agree",
        "stronglyAgree": "Strongly Agree"
      }
    }
  },
  "LearningStyleTest": {
    "learningStyle_intro_title": "Learning Style",
    "learningStyle_intro_highlight": " Test",
    "learningStyle_intro_description": "Based on this test, you will get results on how you learn, following the VARK theory created by Neil Fleming, along with career and skills recommendations.",
    "question_1": "I understand information best when it is presented using diagrams, charts, or videos.",
    "question_2": "Using color-coding or visual aids helps me organize and recall information.",
    "question_3": "I learn more effectively when someone explains concepts to me verbally.",
    "question_4": "Group discussions or talking through ideas help me grasp concepts better.",
    "question_5": "I prefer to learn by reading detailed instructions or writing notes.",
    "question_6": "Writing summaries or lists helps me retain new information.",
    "question_7": "I learn best by doing hands-on activities or experiments.",
    "question_8": "Practicing real-life examples or physically interacting with materials helps me understand better."
  },
  "PersonalityTest": {
    "Personality_intro_title": "Personality",
    "Personality_intro_highlight": " Test",
    "Personality_intro_description": "Based on this type of test, you will get the results of your personality type through the MBTI (Myers-Briggs Type Indicator) developed by Carl Jung and guidance on which career path to choose.",
    "question_1": "I enjoy spending time alone to recharge my energy.",
    "question_2": "I feel more comfortable in small, intimate gatherings than in large social events.",
    "question_3": "I feel energized and motivated after interacting with a group of people.",
    "question_4": "I prefer socializing and engaging with others over spending time alone.",
    "question_5": "I focus on concrete facts and details rather than abstract ideas.",
    "question_6": "I prefer practical solutions to problems rather than relying on theories or concepts.",
    "question_7": "I often think about the future and imagine possibilities that don't yet exist.",
    "question_8": "I rely on my gut feelings or hunches when making decisions.",
    "question_9": "I prioritize logical reasoning and objective analysis when solving problems.",
    "question_10": "I find it more important to focus on fairness and consistency than on people's feelings.",
    "question_11": "I value harmony and seek to maintain positive relationships with those around me.",
    "question_12": "I consider the emotional impact of decisions on others before acting.",
    "question_13": "I prefer to have a structured plan and stick to a schedule in my daily life.",
    "question_14": "I like to make decisions quickly and avoid last-minute changes to plans.",
    "question_15": "I enjoy being flexible and spontaneous rather than following a strict plan.",
    "question_16": "I adapt easily to changes and prefer keeping my options open for as long as possible."
  },
  "InterestTest": {
    "interest_intro_title": "Interest",
    "interest_intro_highlight": " Test",
    "interest_intro_description": "Based on this type of test, you will get results from Holland Theory notes on John Holland and the director of a specially selected profession.",
    "question_1": "I enjoy working with tools or machinery to solve problems.",
    "question_2": "I prefer doing hands-on tasks rather than working with abstract ideas.",
    "question_3": "I like solving complex problems that require deep thinking and research.",
    "question_4": "I am more interested in analyzing data and conducting experiments than in working with people.",
    "question_5": "I enjoy expressing myself through artistic activities like painting, writing, or music.",
    "question_6": "I prefer creating something new or original, like designing a website or writing a story.",
    "question_7": "I enjoy helping others and providing emotional support when needed.",
    "question_8": "I like being around people and prefer to work in a group rather than alone.",
    "question_9": "I enjoy persuading others to take action or to try new ideas.",
    "question_10": "I like taking on leadership roles and making decisions that affect others.",
    "question_11": "I prefer following rules and working in a structured environment.",
    "question_12": "I enjoy working with numbers, organizing data, and managing systems."
  },
  "SkillTest": {
    "skill_intro_title": "Skill",
    "skill_intro_highlight": " Test",
    "skill_intro_description": "Based on this type of test, you will get results from your weaknesses of the skills needed for the current job, based on the definitions in the O * NET Database and career guidance.",
    "question_1": "When faced with a challenging problem, I find multiple ways to approach a solution.",
    "question_2": "I always evaluate different perspectives before making a decision.",
    "question_3": "I can easily apply mathematical concepts to everyday situations.",
    "question_4": "I enjoy solving scientific problems through experimentation and research.",
    "question_5": "I can adjust my study methods based on the subject or task at hand.",
    "question_6": "I frequently track my progress when working on a task or project.",
    "question_7": "I listen carefully to others and fully understand their point of view before responding.",
    "question_8": "I can easily recognize the emotional state of others based on their actions or words.",
    "question_9": "I often consider multiple factors before making an important decision.",
    "question_10": "I feel comfortable teaching or guiding others when they need help learning something new.",
    "question_11": "I actively seek new knowledge and skills to improve myself.",
    "question_12": "I am able to organize my time effectively to meet deadlines.",
    "question_13": "I am able to organize my thoughts clearly and logically in writing.",
    "question_14": "I feel confident speaking in front of groups or audiences.",
    "question_15": "I can understand complex reading material and summarize key points effectively."
  },
  "ValueTest": {
    "value_intro_title": "Value",
    "value_intro_highlight": " Test",
    "value_intro_description": "Based on this type of test, you will get results from your values ​​through Schwartz Value Theory developed by Shalom Schwartz and guidance on which career path to choose better.",
    "question_1": "I value having a flexible work schedule.",
    "question_2": "Maintaining a clear boundary between work and personal life is important to me.",
    "question_3": "Earning a high salary is a top priority for me.",
    "question_4": "I am willing to prioritize job security over job satisfaction.",
    "question_5": "I value roles that encourage innovative ideas.",
    "question_6": "I find routine tasks unfulfilling and prefer work that challenges my creativity.",
    "question_7": "I feel fulfilled when I can positively impact others' lives.",
    "question_8": "I prefer a job that allows me to help individuals or communities in need.",
    "question_9": "Continuous learning and skill development are essential to my career satisfaction.",
    "question_10": "I seek out challenges that allow me to grow and expand my abilities.",
    "question_11": "Receiving recognition for my work is important to me.",
    "question_12": "Achieving measurable success in my career motivates me.",
    "question_13": "I want my work to contribute positively to society or the environment.",
    "question_14": "Making a difference in the world is a key motivator for me.",
    "question_15": "I value the ability to make my own decisions in my work.",
    "question_16": "Having control over my work schedule is essential to me.",
    "question_17": "I prefer a stable job with predictable responsibilities.",
    "question_18": "Job security is more important to me than rapid career growth.",
    "question_19": "I enjoy working as part of a team to achieve common goals.",
    "question_20": "Building strong professional relationships is important to me.",
    "question_21": "I enjoy taking on leadership roles in group settings.",
    "question_22": "I value opportunities to guide and mentor others."
  },
  "AllTest": {
    "allTest_intro_title": "All Test",
    "allTest_intro_highlight": " Assessments",
    "allTest_intro_description": "Based on this type of test, you will get results from your personality type, interest, strengths and weaknesses, values, Learning Style, and career guidance, majors to choose better."
  },
  "SideBarProfile": {
    "menuItems": {
      "testHistory": {
        "title": "Test History",
        "description": "View your History Test"
      },
      "draftTest": {
        "title": "Draft Test",
        "description": "View Your Test Draft"
      },
      "bookmarks": {
        "title": "Bookmarks",
        "description": "View Your Bookmarks"
      },
      "aboutYou": {
        "title": "User Information",
        "description": "View Your Information"
      },
      "logout": {
        "title": "Logout",
        "description": "Sign out from your account"
      }
    },
    "modalLogout": {
      "title": "Confirm to Logout",
      "description": "Are you sure you want to logout?",
      "confirm": "Logout",
      "cancel": "No"
    },
    "toastMessages": {
      "profileImage": {
        "success": "Profile image updated successfully!",
        "error": "Failed to upload the profile image. Please try again.",
        "sizeError": "File size exceeds the 5MB limit!"
      },
      "logout": {
        "success": "Logged out successfully!",
        "error": "Failed to log out. Please try again.",
        "genericError": "An error occurred during logout."
      }
    }
  },
  "ProfileAboutUser": {
    "form": {
      "fields": {
        "username": {
          "label": "Name",
          "placeholder": "Enter your name"
        },
        "password": {
          "label": "Password",
          "placeholder": "••••••••",
          "button": "Change"
        },
        "date_of_birth": {
          "label": "Date of Birth"
        },
        "gender": {
          "label": "Gender",
          "placeholder": "Select your gender",
          "selectFemale": "Female",
          "male": "Male"
        },
        "phone_number": {
          "label": "Phone Number",
          "placeholder": "Enter your phone number"
        },
        "address": {
          "label": "Address",
          "placeholder": "Enter your address"
        },
        "bio": {
          "label": "About You",
          "placeholder": "Tell us about yourself"
        }
      },
      "buttons": {
        "submit": {
          "default": "Update Profile",
          "loading": "Updating..."
        }
      }
    },
    "ChangePassword": {
      "heading": "Change Your New Password",
      "form": {
        "fields": {
          "old_password": {
            "label": "Old Password",
            "placeholder": "Enter your old password",
            "error": "Old password is required"
          },
          "new_password": {
            "label": "New Password",
            "min": "New Password must be at least 8 characters",
            "placeholder": "Enter your new password",
            "error": "New password is required",
            "pattern": "New Password must be have alphanumeric characters, numbers and underscores.",
            "required": "New password is required"
          },
          "confirm_new_password": {
            "label": "Confirm New Password",
            "placeholder": "Enter your new password confirmation",
            "error": "Password confirmation does not match",
            "match": "ពាក្យសម្ងាត់ថ្មីត្រូវតែដូចជាមួយការបញ្ជាក់ពាក្យសម្ងាត់",
            "required": "អ្នកត្រូវបញ្ជូលបញ្ជាក់ពាក្យសម្ងាត់របស់អ្នក"
          }
        },
        "buttons": {
          "submit": {
            "text": "Change",
            "loading": "Changing..."
          },
          "cancel": {
            "text": "Cancel"
          }
        }
      },
      "notifications": {
        "success": "Your password has been successfully changed.",
        "error": "Failed to change your password. Please try again."
      }
    },
    "title": "User Information"
  },
  "TestHistoryUser": {
    "title": "Test History",
    "TestAction": {
      "view": "View",
      "copy": "Copy",
      "delete": "Delete"
    },
    "test-placehoder": {
      "title": "No History Test Yet.",
      "description": "Please Try to test.",
      "now": "Test Now"
    },
    "DeleteTestModal": {
      "heading": " Confirm Deletion Test",
      "description": "Are you sure you want to delete ",
      "confirm": "Delete",
      "cancel": "Cancel"
    },
    "ShareResultPopup": {
      "heading": "Share the results ",
      "colorHeading": "of your test",
      "subHeading": "Allow your family and friends to view your results by sharing this link.",
      "loadingMessage": "Loading...",
      "inputPlaceholder": "http://example.com/link/to/document",
      "buttons": {
        "cancel": "No",
        "share": {
          "default": "Share",
          "shared": "Shared"
        }
      }
    }
  },
  "DraftHistory": {
    "title": "Draft Test",
    "DraftAction": {
      "view": "View",
      "delete": "Delete"
    },
    "DeleteDraftModal": {
      "heading": "Delete Draft",
      "description": "Are you sure you want to delete this Daft?",
      "confirm": "Yes",
      "cancel": "No"
    },
    "draft-placehoder": {
      "title": "No Draft Test Yet.",
      "description": "Please Try to draft your test."
    }
  },
  "BookmarkHistory": {
    "title": "Bookmarks History",
    "BookmarkAction": {
      "view": "View",
      "delete": "Delete"
    },
    "DeleteBookmarkModal": {
      "heading": "Delete Bookmark",
      "description": "Are you sure you want to delete this bookmark?",
      "confirm": "Yes",
      "cancel": "No"
    },
    "BookMarkHolder": {
      "title": "No Bookmarked Jobs Yet.",
      "description": "Please Try to bookmark your jobs.",
      "now": "Now"
    }
  },
  "Pagination": {
    "page": "Page",
    "of": "of"
  },
  "Login": {
    "left": {
      "title": "Welcome to E-Found Official Website",
      "description": "Discover your potential and explore specialized skills at a university that aligns with your interests, strengths, and future career goals."
    },
    "form": {
      "title": "Login",
      "fields": {
        "email": {
          "label": "Email",
          "placeholder": "Enter your email",
          "error": "Email is required."
        },
        "password": {
          "label": "Password",
          "placeholder": "Enter your password",
          "error": "Password is required."
        },
        "googleaccount": {
          "label": "Sign in with Google",
          "textOr": "OR"
        }
      },
      "forgotpassword": "Forgot Password",
      "buttons": "Login",
      "text": "Don't have account yet?",
      "signup": "Sign up"
    }
  },
  "Register": {
    "left": {
      "title": "Welcome to E-Found Official Website",
      "description": "Discover your potential and explore specialized skills at a university that aligns with your interests, strengths, and future career goals."
    },
    "form": {
      "title": "Register",
      "fields": {
        "username": {
          "label": "Name",
          "placeholder": "Enter your name",
          "error": "Name is required."
        },
        "email": {
          "label": "Email",
          "placeholder": "Enter your email",
          "error": "Email is required."
        },
        "password": {
          "label": "Password",
          "placeholder": "Enter your password",
          "error": "Password is required."
        },
        "confirmPassword": {
          "label": "Confirm Password",
          "placeholder": "Enter your confirm password",
          "error": "Password confirmation does not match."
        }
      },
      "policyPage": "Policy and Privacy",
      "Or": "OR",
      "ContinuewithGoogle": "Continue With Google",
      "agree": "I agree to Privacy Policy",
      "buttons": "Register",
      "text": "Already have account?",
      "login": "Login"
    }
  },
  "ForgotPassword": {
    "title": "Forgot Password",
    "description": "Please input your email for get your code.",
    "fields": {
      "email": {
        "label": "Email",
        "placeholder": "Enter your email",
        "error": "Email is required."
      }
    },
    "buttons": "Send"
  },
  "ResetPassword": {
    "title": "Reset Password",
    "description": "Please input your new password.",
    "fields": {
      "password": {
        "label": "New Password",
        "placeholder": "Enter your new password",
        "error": "New Password is required."
      },
      "confirmPassword": {
        "label": "Confirm New Password",
        "placeholder": "Enter your confirm new password",
        "error": "Password confirmation does not match."
      }
    },
    "buttons": "Reset Password"
  },
  "VerifyCodeForgot": {
    "title": "Verify Code",
    "description": "Please input your verification code.",
    "time": "s",
    "buttons": "Verify Code",
    "buttonVerifyAgain": "Recent Verify Code"
  },
  "VerifyCodeRegister": {
    "title": "Verify Code",
    "description": "Please input your verification code.",
    "buttons": "Verify Code",
    "buttonVerifyAgain": "Recent Verify Code"
  }
}
